[
  {
    "url": "https://connect.mq.edu.au/s/article/Special-Consideration-how-do-I-apply",
    "text": "19 Aug 2025\nKnowledge\nIf you have experienced a short term, serious and unavoidable disruption that has impacted your ability to complete or prepare for an assessment task, you may be eligible to apply for Special Consideration.\n\nBefore you apply for Special Consideration, please read the following related articles, which will assist you with your application(s).\n\nRelatedSpecial Consideration articles\nEligibility -Am I eligible to apply for Special Consideration?\nSupporting evidence-What supporting evidence do I need to apply for Special Consideration?\nAttempt or submit -If I apply for Special Consideration do I still submit or attempt my assessment?\nIEAP planned extensions -How and when do use my IEAP planned extension via Special Consideration?\nOther FAQ -Frequently asked questions about Special Consideration?\n\nHow to apply:\nCheck youreligibility,\nGather yoursupporting documentation,\nCheck the task(s) and unit(s) you need to apply for. As not every assessment task is assessable, please read theunit guidesand checkiLearnfor assessable tasks before applying,\nComplete aSpecial Consideration formand submit your application.\nMake sure you submit your application before, or no later than, five working days after the due date of the assessment task.\n\nAfter submitting your Special Consideration application:\nWhile you wait for the outcome of your application please be mindful of the following:\nThe University will aim to let you know of the outcome within 5 working days of applying. This may take longer during peak periods.\nOnce fit to do so you should continue to work on your assessment and complete a finalised assessment as soon as possible.\nOutcomes will be reflective of the disruption period which is confirmed by supporting evidence. Therefore application outcomes such as retrospective extensions can occur (e.g. an extension date which has already past).\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Special-Consideration-eligibility",
    "text": "1 Sept 2025\nKnowledge\nYou may be eligible to apply for Special Consideration if you have experienced a short term, serious and unavoidable disruption that has impacted your ability to complete or prepare for an assessment task.\n\nHere are answers to some frequently asked questions about Special Consideration and your eligibility:\n\nWhat circumstances are eligible for Special Consideration?\nSpecial Consideration is applicable to short-term, serious, and unavoidable circumstances only.\nCircumstances are classified as serious and unavoidable if they:\ncould not have reasonably been anticipated, avoided or guarded against by the student; and\nwere beyond the student's control; and\ncaused substantial disruption to the student’s capacity for undertaking assessment for the unit(s); and\noccurred during the critical study period (and were at least three (3) consecutive days duration or a total of five (5) days within the teaching period); and/or\nprevented completion of an assessment task scheduled for a specific date\nExamples of eligible circumstances can include: short term illness, accidents, natural disasters, weddings, trauma/hardship, unexpected/non routine work commitments, and death.\n\nWhat circumstances are not eligible for Special Consideration?\nThe following are examples of events thatare notconsidered eligible for Special Consideration:\nReading the Unit Guide incorrectly\nAttending events such as: concerts, talk shows, sporting events, protests\nPre-booked holidays\nRoutine employment\nA heavy academic workload\nMisreading the assessment requirements and/or deadlines such as the examination timetable\nProfessional Experience - independently organised by the student\nOther events or activities not related to current employment or studies\n\nCan I apply for Special Consideration if I have been impacted by prolonged (but not ongoing) circumstances?\nSpecial Consideration is applicable to short-term, serious, and unavoidable circumstances only. Any disruption that is more than a few weeks long is generally not considered to be short-term and therefore might not be eligble. If students have been impacted by circumstances that are prolonged, but not ongoing, then students should provide documentation that confirms a specific and recent impact on their ability to complete current assessment tasks.\n\nExamples of prolonged, but not ongoing, disruptions can include eg injury, accommodation crisis, medical procedure/recovery.\n\nWhether using formal supporting evidence or a Statement of Fact, supporting documentation needs to indicate specify exact dates of impact and how your circumstances have impacted current assessments.\n\nCan I apply for Special Consideration if I have been impacted by ongoing circumstances?\nSpecial Consideration is designed to support students with short term disruptions or short-term exacerbations of ongoing circumstances.\n\nIf you experience ongoing circumstances such as chronic illness/disability or carer commitments, you should explore support options such as reasonable adjustments offered throughAccessibility Services at Student Wellbeing.\n\nIf you are registered with Accessibility Services, reasonable adjustments may be eligible towards your studies and the instances in which you would need to apply for Special Consideration are simplified. Please see our helpful article onSpecial Consideration for IEAP students.\n\nCan I apply if I experience technical issues and what evidence do I need?\nIf you have experienced technical issues which are serious, unavoidable, unexpected and beyond your control, you must provide supporting evidence showing this. Supporting evidence in these circumstances must be dated and time stamped.\n\nCircumstances which arenot eligibleinclude:\nuploading the incorrect file\nnot saving an assessment file\nplanned internet outages.\n\nRelated Special Consideration articles\nWhat is Special Consideration and how do I apply?\nHow and when do use my IEAP planned extension via Special Consideration?\nWhat supporting evidence do I need to apply for Special Consideration?\nIf I apply for Special Consideration do I still submit or attempt my assessment?\nFrequently asked questions about Special Consideration?"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Special-Consideration-supporting-evidence",
    "text": "19 Aug 2025\nKnowledge\nSupporting evidence is a requirement of an application for Special Consideration. It determines if your application is eligible and impacts what the outcome to your application will be.\n\nSupporting evidence must:\nidentify the nature of the circumstances\ninclude dates and/or the length of the circumstances\nexplain the severity and impact of the circumstances\nclearly describe how the circumstances have adversely affected your capacity for effective study related to the assessment/exam\ninclude the date(s) on which you were seen by the professional providing the evidence (if applicable)\n\nRecommended supporting evidenceVarious documentation types can be used as supporting evidence, the below table outlines the recommended forms of evidence based on the disruption type.\nFor a full list of acceptable evidence forms see theSpecial Consideration Supporting Evidence Schedule.\n\nOfficial letter and/or documents from the relevant source/authority. For example:\nWedding invitations accompanied by Statutory Declaration or Statement of Fact*\nLetter from religious leader/Elder\nLetter from employer stating why you cannot be released from the unexpected work commitments\nLetter from doctor/medical certificate\nLetter confirming your attendance to Jury Duty/court date\n\nHere are answers to some frequently asked questions about supporting evidence:\n\nWhen can I use a Statement of Fact as supporting evidence*?\nA Statement of Fact can be used as supporting evidence:\nfor all event/disruption types other than Elite Athlete commitments,\nif the event/disruption duration is 5 days or less,\nif it is used only once per assessment task (it cannot be used for the same assessment task more than once or to request a further outcome for the same assessment task).\nMultiple uses of a Statement of Fact in relation to the same disruption will be considered as a disruption that is longer than 5 days in duration, formal evidence will likely be requested instead.\n\nWhy was my Statement of Fact not accepted as supporting evidence?\nIf your Statement of Fact does not include sufficient detail, or if it does not allow for your circumstances to be confirmed as serious and unavoidable, it will not be accepted.\nPlease provide independently corroborated forms of documentation that clearly demonstrate serious and unavoidable circumstances.\n\nDo I need to provide other evidence if I use a Statement of Fact?\nYou do not have to include other evidence when applying, however you may be requested to provide additional supporting evidence when your application is reviewed.\nIf you are able to obtain recommended supporting documentation forms, please use these documents rather than a Statement of Fact.\n\nWhat evidence do I need to provide if I have Covid-19?\nA RAT will not be accepted. Provide other medical evidence such as a medical certificate.\n\nDoes my supporting evidence need to be in English?\nIf your supporting evidence is not in English it cannot be assessed. This will result in your application being rejected for insufficient evidence.\n\nWhat is a Professional Authority Form (PAF) and can I use it as evidence?\nIt is a MQ form that students can have their health professional complete to then use as your supporting evidence. This includes all the relevant details your health professional needs to provide and can simply your application process. Students can access the MQ PAF via thefollowing link.\n\nWhat happens if misleading or fraudulent evidence is used in an application for special consideration?\nThe university reviews all supporting evidence provided in Special Consideration applications.\n\nWhere misleading or fraudulent information/documents are submitted, this will be reported to the Complaints, Appeals and Misconduct Unit.\n\nAny application with misleading or fraudulent information will be denied Special Consideration, and the likely outcome is 0% for the assessment task.\n\nNo further consideration for that assessment task will be given should other evidence be provided.\n\nRelated Special Consideration articles\nWhat is Special Consideration and how do I apply?\nAm I eligible to apply for Special Consideration?\nHow and when do use my IEAP planned extension via Special Consideration?\nIf I apply for Special Consideration do I still submit or attempt my assessment?\nFrequently asked questions about Special Consideration?"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Special-Consideration-impact-of-attempting-or-submitting-an-assessment-task",
    "text": "19 Aug 2025\nKnowledge\nIn addition to meeting eligibility requirements for Special Consideration, yourSpecial Consideration applicationis impacted by if and when you attempt and/or submit an assessment task.\n\nIf you attempt and/or submit the assessment task as per the originally scheduled date/time, no Special Consideration will be granted. So it is important that you only attempt and/or submit assessment tasks when you are fit to do so.\n\nThe following provides scenarios, FAQs and key advice for students as to how attempts/submission impact their application eligibility:\n\nHow will an attempt/submission impact my Special Consideration eligibility?\n\nExamples of how your application can be impacted by an attempt/submission are as outlined below.\n\nFortimed assessments, such as exams, tests or quizzes\n\nIf you are unfit/unable to attempt the assessment due to aneligible disruption, you can apply for Special Consideration before the assessment occurs.\n\n\nExamples forassessments with submission due dates, such as essays or assignments\n\n\n\nNotes:* See the Exceptional Circumstances FAQ at the bottom to this page.** See the FAQ relating to how to report a disruption during an attempt.\n\n\nHere are answers to some frequently asked questions about attempting/submitting an assessment:\n\nShould I submit a draft or partial submission?\nYou should only submit your best and final attempt of the assessment. Do not intentionally submit a draft or part attempt. Once an attempt/submission has been made, no further attempt/submission is permitted, except in exceptional circumstances*.\n\nIn addition, Special Consideration also does not permit lenient marking under any circumstances. You should only be attempting/submitting when you can perform at your usual academic level.\n\n* See the Exceptional Circumstances FAQ at the bottom to this page.\n\nHow do I report** a disruption during my assessment attempt?\nIf your assessment is supervised, you should inform the supervisor immediately.\n\nIf the disruption occurs during an unsupervised assessment, you should report it immediately through the appropriate channels.\n\nFor example, you might report technical issues to IT and submit aOneHelpticket.\n\nTimed Assessments - What should I do if I have not received an outcome to my application, should I attempt my assessment if I feel unwell?\nIf you are unfit to make an attempt then you should not attempt the assessment. Once you make an attempt you will no longer be eligible to seek Special Consideration*.\n\nObtain appropriate supporting evidence and apply for Special Consideration within the required deadline.\n\nAssessments with a Submission Due Date - What should I do if I have not received an outcome to my application and it is the due date of my assignment?\nYou can continue to work on the assessment if you are fit to do so, you may then submit your best/final version of the assessment once you are able to perform at your usual academic level.\n\nPlease keep in mind that if an on time submission of the assessment was made, then no Special Consideration will be given*. If no on time submission was made, then outcomes will usually be reflective of the disruption period which is confirmed by supporting evidence.\n\nWhat are exceptional circumstances* and what formal evidence do I need?\nWe will only consider giving you a second opportunity to submit/attempt your assessment task if there were exceptional circumstances that significantly impacted your performance.\n\nExceptional circumstances are significant disruptions that:\nprevented you from making a reasonable judgement if you should have attempted the assessment, and,\nresulted in an impaired attempt of the assessment task.\nExample scenarios include: the death of a relative on the day of your exam.\n\nIf you are seeking to declare exceptional circumstances and apply for Special Consideration:\nYou must apply promptly after the impaired attempt. Students need to apply with five working days of the assessment due date. Students will not be eligible if they wait for results of the attempt and then apply for Special Consideration.\nYou will need to provide formal and independently verified evidence. A Statement of Fact cannot be used.\nExamples of formal evidence include: a Professional Authority Form (PAF) from a medical professional that clearly states the student was incapable of making a reasonable judgement when deciding to attempt the assessment.\n\nPlease keep in mind that applying for exceptional circumstances does not guarantee that your application would be considered. Applications will be reviewed on a case by case basis.\n\n\nRelated Special Consideration articles\nWhat is Special Consideration and how do I apply?\nAm I eligible to apply for Special Consideration?\nHow and when do use my IEAP planned extension via Special Consideration?\nWhat supporting evidence do I need to apply for Special Consideration?\nFrequently asked questions about Special Consideration?"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Special-Consideration-IEAP",
    "text": "19 Aug 2025\nKnowledge\nIf you have 'planned extension adjustments' for individual written assignments listed on yourIndividual Education Access Plan (IEAP), please refer to this article on IEAP for details about how to let us know that you would like to use the adjustment and for which assessment. For all other adjustment types refer to your IEAP for instructions.\n\nHere are answers to some frequently asked questions about how and when to use your planned IEAP extension via Special Consideration:\n\nShould I register for an IEAP if I am impacted by ongoing circumstances?\nIf you are experiencing ongoing circumstances such as chronic illness, disability or carer commitments, you should explore support options such as reasonable adjustments offered through Accessibility Services at Student Wellbeing.\n\nIf you are registered with Accessibility Services, you may be eligible for reasonable adjustments for your studies, and this will simplify the circumstances in which you would need to apply for Special Consideration.\n\nSpecial Consideration is applicable to short-term, serious, and unavoidable circumstances only.\n\nDoes my planned extension need to be used first?\nYour IEAP planned extension can only be applied from the original assessment due date. If you have already received an approved Special Consideration extension and still require extra time, you cannot then submit a Planned Extension application.\n\n\nI am an IEAP student. What evidence do I need to provide when applying for Special Consideration?\nSupporting evidence requirements vary based on your reason for applying. If you have an adjustment for planned extension listed on your IEAP and you wish to use that extension, you will need to request this on yourSpecial Consideration formunder the event category of 'Planned extension with IEAP adjustment'. You do not need to attach any evidence to your application.\n\nIf you are unable to complete an assessment task due to other impacts separate to that of your IEAP or experience an additional disruption, you will need to provide valid forms ofsupporting evidence.\n\nHow often can I apply for an extension using my IEAP?\nYour IEAP can only be used to request one extension per assessment task. After this, you will need to provide other valid forms of supporting evidence.\n\nImportant:An IEAP planned extension provision can be applied towards eligible assessment types only. Please refer to your IEAP for details as to which assessments are covered by your IEAP.\n\nCan I apply for an extension for a Quiz, Test, or Take-Home Exam with my IEAP?\nPlanned extension adjustments cannot be used for missing quiz/tests/exams or to request extra time to complete a quiz/test/exam.\n\nIf you are unable to sit a quiz/test/exam at the scheduled date/time, you will need to apply for special consideration, providing evidence relating to the disruption that has prevented you from sitting the quiz/test/exam.\n\nExtra time for tests, quizzes, or exams will be applied as per the listed adjustments on your students IEAP (eg. 25% extra time) – you do not need to submit a special consideration request to have your extra time adjustments applied.\n\nWhen can I use my IEAP extension?\nYou can apply for your IEAP extension forlong-form individual written assessments only.\n\nThe following assessments tasks arenot coveredunder this recommended adjustment:\nshort written tasks\nin-class/online tests\nexams/supplementary exams\npresentations\ngroup work activities\nweekly tasks\nPACE/placement\ntake home assignments and exams\nclass attendance\nclinical and practical assessment tasks\ntimed assessments\n\nWhat happens after I have applied for Special Consideration to use my IEAP extension?\nWe will review your IEAP extension request and will aim to respond within five working days.\n\nYou should continue to work on your assessment task while you wait for the notification of the outcome of your request. If you do not hear a response prior to the due date, you should work towards submitting the assessment task on the due date aligned with your IEAP.\n\n\nRelated Special Consideration articles\nWhat is Special Consideration and how do I apply?\nAm I eligible to apply for Special Consideration?\nWhat supporting evidence do I need to apply for Special Consideration?\nIf I apply for Special Consideration do I still submit or attempt my assessment?\nFrequently asked questions about Special Consideration?\n\nIEAP student resources- For further information from Accessibility Services about your planned extension students may wish to refer to theAccessibility Services guide."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Frequently-asked-questions-about-Special-Consideration",
    "text": "19 Aug 2025\nKnowledge\nThe following articles will assist you with your application(s):\nWhat and how to apply -What is Special Consideration and how do I apply?\nEligibility -Am I eligible to apply for Special Consideration?\nIEAP planned extensions -How and when do use my IEAP planned extension via Special Consideration?\nSupporting evidence -What supporting evidence do I need to apply for Special Consideration?\nAttempt or submit -If I apply for Special Consideration do I still submit or attempt my assessment?\n\nOther common questions you might have regarding the Special Consideration process and applications can be found below:\n\nFinal Exams and Supplementary Exams\n\nAm I eligible to request an Online Final Exam?\nCriteria relating to Session 2 2025 Final Exams has not yet been released. Further information is expected to be made available once the Draft Examination Timetable is released on approx. the 1/10/2025. In the meantime, please ensure you carefully check your unit mode and assessment requirements when enrolling.\n\nShould I apply for Special Consideration if my LAWS Take Home Exam clashes with a Final Exam?\nIf your LAWS unit Take Home Exam clashes with a formal Final Exam as listed on the Examination Timetable, you may apply for Special Consideration for the LAWS unit only. A clash is eligible for Spec Con if both assessments occur at the same time or within one hour of another. Students should wait until the Final Exam Timetable is released before applying.\n\nWhat is a Supplementary Exam and when do they occur?\nIf approved for Special Consideration in relation to a final exam (which occurred during the formal examination period) you may be granted a supplementary exam. If granted a Supplementary Exam, the Supplementary Exam period occurs:\nFor Session 2 2025 units:  11/12/2025-23/12/2025\nFor Session 3 2025 units: 16/02/2026-19/02/2026\nFor Session 1 2026 units:  9/07/2026-21/07/2026\nIf approved for a Supplementary Exam students are expected to ensure their availability during this period.\n\n\nApplication Process & Form\n\nHow long do I have to apply for Special Consideration?\nYou should apply no later than five (5) working days after the assessment date. If you are applying more than five (5) working days after the assessment date, you must justify or explain this timing in your application. Applications submitted outside the required timeframe are not guaranteed and are only considered for Special Consideration in exceptional circumstances.\n\nHow do I apply for more than one assessment task in the application form?\nYou may add more than one unit and/or assessment to your application form. To add more units/assessment to your form use the 'Add' button.\n\nMy unit code is missing from the application form, what do I do?\nIf your unit doesn’t appear as an option in your Special Consideration form it is because you are no longer enrolled in the unit. If you have received a result (eg P, F, FA), and you believe it’s incorrect due to a previously approved Special Consideration, you may need to submit a Grade Appeal instead.\nOnce final results are released, you can’t use Special Consideration to explain something that’s already affected your grade.​ Reminder: Special Consideration needs to be submitted within 5 working days of the assessment due date.\n\n\nAfter Applying\n\nI am not happy with the outcome of my application, what should I do?\nPlease check your outcome email which will explain:\nwhy your application was not approved, and/or\nmay have advice or instructions for further actions if appropriate.\nPlease note in some instances your Special Consideration might have been closed requesting you instead reapply with missing evidence/information/application details in order then reassess your application.\nIf you wish submit an academic appeal, refer to the appeals web page for more information. Appeals must be submitted within 10 working days of your application outcome. We recommend you consult the Special Consideration articles and policy prior to submitting an appeal.\nCan I apply for Special Consideration after the release of final results?\nApplications must be submitted no later than five working days after the assessment due date. If an application is beyond this deadline and therefore is submitted after the release of final results, it is too late to be considered.\n\n\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Grades",
    "text": "25 Sept 2024\nKnowledge\nAlong with HD, D, Cr, & P, there are some other grades you may come across.\nI\" or \"IS\" grades indicate the unit is \"incomplete\". You might get an incomplete:\nIf you completed a supplementary exam less than 2 weeks ago\nYour Special Consideration application is in progress\nThe grades for the unit have not been finalised\nGrades starting with \"U\" (UD, UJ, UL, UE) indicate the result is not finalised and/or released.If you're not sure why you have a grade starting with \"U\", contact your Unit Convenor using the contact details oniLearn.\nFurther information about description for each grade can be found inGrading System.\n\nRelated articles\nResults"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Qualification-Check",
    "text": "Graduation\n2 Oct 2024\nKnowledge\n\nHow do I check the progression of my course?\nComplete the Course Guidance Self Check. If you require further assistance after completing this self check, you can submit a question via theCourse Guidance form.\n\nWhen should I submit a Qualification Check form?\nYou can submit aQualification Check formby theCensus Dateof your final study period.\n\nI'm a coursework student. Should I submit a Qualification Check form?\nIf you are a coursework student, youcan submit aQualification Check formto exit with a single degree from a double degree.\nPlease review the details of your course and provide details of any changes required.\nImportant:Please specify what degree or qualification you want to exit from.\n\nI am a Bachelor of Psychology (Honours) student. How do I graduate without Honours?\nIf you are in your final study period and currently admitted in the Bachelor of Psychology (Hons) course, however, would like to graduate without Honours, please state this on theQualification Check form.\n\nCan I nominate a major/minor/specialisation on my Qualification Check form?\nIf there are missing major/minors and/or specialisations on yourQualification Check form, please edit as required.\n\nI'm studying a Higher Course Research program. How do I find out if I can graduate?\nIf you are studying a Higher Course Research program, please refer to theGraduate Research Academyfor further information.\n\nI've submitted a Qualification Check form. Why am I still admitted?\nIf you do not meet the requirements for your course at the end of the nominated completion period, you will not be qualified, and your course status will remain as 'admitted'.\nPlease refer to the Qualification Self-Check in theCourse Guidance Formto confirm you meet all the requirements for your course.\nIf you have incomplete grades at the time of completion, you will not be qualified at result release. We will assess you for qualification within 15 business days of your incomplete grades being finalised.\n\nWhat does exiting my degree mean?\nExiting your course means that you are graduating with an approved lower award provided you meet the requirements.\n\nRelated articles\nQualification Check - double degree\nExpect to Complete\nCourse Guidance for continuing students"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Course-Guidance-Course-progression",
    "text": "Course Progression\n28 Aug 2025\nKnowledge\nIf you would like further information about your course progression or a better understanding of whether you are on the right track to meet the requirements for your course, the Course Progression section of theCourse Guidance Toolcan assist you.\nThis tool will give you the resources and information required for you to complete a Course Progression check.\nBefore you begin\nDownload a copy of your unofficial Transcript through eStudent.\nThe form will advise you of any further documentation needed depending on your cohort.\n\nIf I change major, minor or specialisation, how will this impact my studies?\nIf you want to change your major, minor or specialisation but are not sure how this might affect your studies, the Course Changes section of theCourse Guidance Toolcan help you understand any impacts that this may have on your degree.\nThis form can also help you determine whether you are eligible to add a second major.\n\nIf I transfer to another course, what career will it lead to?\nSearch theFind a Coursewebsite to review courses that may interest you and view potential professions for each course via the Career Outcomes tab.\nYou can also visit theCareers and Student Employmentwebpage for career resources.\nTheCourse Guidance Toolhas more information about how a Course Transfer may affect your course.\n\nRelated articles\nCourse Guidance for new students\nChange of major, minor or specialisation FAQ\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Course-Guidance-new-students",
    "text": "Course Changes\n28 Aug 2025\nKnowledge\nIf you are starting your first session at Macquarie and are not sure what units you need to take, there are several different resources you can use.\nPlease checkUnit levelsandUnit Offeringsto understand what these mean when choosing your units.\nTheCourseHandbookis where you can find your course structure. You can use the Handbook to view different course components (including majors, minors, specialisation), unit offerings, learning outcomes and pre-requisites. The Handbook is a great tool to help you plan the units you need to undertake.\nFor a guide on what units to study when you first start your course, theEnrolment Guidescan help recommend a list of units to enrol into. These guides are created by the faculty, but please note these guides are still only a suggestion and you are free to enrol into other units if you wish.\nIf you are more than half-way through your course, you can complete a self-check via theCourse Guidance Tool.\nRelated articles\nCourse Guidance for continuing students"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Academic-Support",
    "text": "Course Progression\n28 Aug 2025\nKnowledge\nYou can access a range of academic and social support services to assist you throughout your studies at Macquarie University.\nThe academic support services available to you include:\nWriting Centre: You can access resources on academic writing, referencing, exam strategies and much more.\nNumeracy Centre: You can access assistance with mathematical knowledge, skills and confidence.\nLibrary: You can access workshops, training sessions, subject and research guides.\nPeer Support: You can access peer support initiatives through Peer mentors, Faculty mentoring, Peer assisted study sessions (PASS) or Buddy program.\nRelated ArticlesStudent support services\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Student-support-services",
    "text": "Course Progression\n28 Aug 2025\nKnowledge\nYour success at Macquarie University is important to us. The University offers academic, wellbeing and IT support services to help you to succeed in your studies.\nYou can access a wide range of services and self-assessment tools to assist you with determining appropriate resources to help with your studies.\nCheck out the tools and resources we provide to help you improve your skills to achieve that successful outcome.\nUniversity Support Services and Resources\nstudy support\nsocial support\npersonal support\nspiritual support\nstudent care and reporting\nRelated ArticlesAcademic Support"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Withdrawal-Without-Penalty-how-to-apply",
    "text": "Course Progression\n5 Aug 2025\nKnowledge\nYou can apply for Withdrawal Without Penalty (WWP) if you have:\nbeen impacted by a serious and unavoidable disruption after the census date\nexperienced circumstances that have prevented you from successfully passing or completing a unit.\nPlease note:You cannot apply for Withdrawal Without Penalty for units that you have passed.\nWithdrawal Without Penalty will be granted where Macquarie University is satisfied that the circumstances you faced:\nwere beyond your control\ndid not make their full impact until on, or after the census date for the unit of study, and\nmade it impracticable to complete the requirements for the unit during the period for which the student undertook or was to undertake the unit\nBefore you begin:\nFamiliarise yourself withWithdrawal Without Penalty policy\nPrepare your supporting documentation to attach with your application.\nThen complete and submit theWithdrawal Without Penalty form."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Concurrent-Studies-FAQ",
    "text": "14 July 2025\nKnowledge\nWith concurrent studies you can complete an approved unit at another Australian institution and have it credited towards your admitted course at Macquarie University.\n\nYou will find answers to frequently asked questions about concurrent studies below.\n\nAm I eligible for concurrent studies?\nTo be eligible for concurrent studies:\nYou must be a Commonwealth Supported student\nYou must not have an Academic Standing of Academic Pause\nYou must apply for a unit at an Australian Institution\n\nDoes the unit with the other institution count towards a full-time load at Macquarie University?\nUnits taken at another university do not count towards a full-time status and they donotcontribute towards your Weighted Average Mark (WAM) at Macquarie University.\n\nDoes Macquarie University help me liaise with the other institution?\nYou are responsible for contacting the other institution to confirm application dates, procedures and appropriate documentation.\nImportant:Macquarie University does not contact other institutions on your behalf.\n\nI am an international student. Can I apply for concurrent studies?\nTo be eligible for concurrent studies, you must be a Commonwealth Supported Place (CSP) student.\nYou can find out more atCommonwealth Supported Places.\n\nWhat documentation do I need to provide for my concurrent studies application?\nYou will need to apply via theRecognition of Prior Learning (RPL)form and attach the following documentation to support your request:\nRelevant unit guide/s from the external institution; and\nA completed cross-institutional studies form from the external institution\n\nHow to differentiate a concurrent studies application from a Recognition of Prior Learning (RPL) application?\nWhen completing theRecognition of Prior Learning (RPL)application,follow the instructions below to differentiate your concurrent studies application from an RPL application:\nIn the Requested specific credit screen:List the institution you plan on taking the concurrent studies (i.e. Griffith University)Course is “Concurrent Studies”Course Type is “Other”Course Duration is “6 months”\nList the institution you plan on taking the concurrent studies (i.e. Griffith University)\nCourse is “Concurrent Studies”\nCourse Type is “Other”\nCourse Duration is “6 months”\nContinue to complete the rest of the RPL form\n\nHow long does my concurrent studies application take?\nApplications for concurrent studies generally take up to 20 business days to be completed.Once approved, you will receive an official letter that shows your approved concurrent studies application.\n\nNext steps\nOnce you have completed the approved concurrent study unit(s) and your transcript is available. Please submit a newRecognition of Prior Learning (RPL)request via the Service Connect Portal.\nIn this application, please attach your official transcript along with the approval letter we have provided you. This will fast track the PRL process, and the approved credit will be applied to your course without the need for any further approval.\nPlease note, the transcript must clearly show that you have successfully passed the unit(s) for the credit to be applied to your current course\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Course-Transfer-eligibility",
    "text": "Course Changes\n19 June 2025\nKnowledge\nIf you want to transfer to a new course, you must meet the eligibility criteria below:\nMeet the course entry requirements listed in theCourse Transfer Requirements Table.NOTE: All course transfers are not automatic, and not all courses are available for transfer.\nMeet the course entry requirements listed in theCourse Transfer Requirements Table.NOTE: All course transfers are not automatic, and not all courses are available for transfer.\nMust be Admitted/Leave of Absence in an undergraduate bachelor’s degree at North Ryde\nMust be Admitted/Leave of Absence in an undergraduate bachelor’s degree at North Ryde\nHave effective enrolment (e.g. Passed, Failed, Withdrawn grade) in your current course\nHave effective enrolment (e.g. Passed, Failed, Withdrawn grade) in your current course\nNot have any enrolment for Winter Vacation, short-term Exchange (July) or Full Year units for a Session 2 transfer\nNot have any enrolment for Winter Vacation, short-term Exchange (July) or Full Year units for a Session 2 transfer\nNot have any enrolment for short-term exchange (January) units for a Session 1 transfer\nNot have any enrolment for short-term exchange (January) units for a Session 1 transfer\nNot be on exchange or have an incomplete exchange grade\nNot be on exchange or have an incomplete exchange grade\n\nHow do I read the Course Transfer Requirements table?\nThe Course Transfer Requirements Table can be confusing, here are some useful information for you to understand how it works:\nRPL:If you plan to use specified credit (RPL) to mee the Course Transfer Requirements, it must be granted and applied to your study plan before you apply for Course Transfer. If not, your application will be cancelled. Not all requirements allow for RPL to be used towards entry.\nRPL:If you plan to use specified credit (RPL) to mee the Course Transfer Requirements, it must be granted and applied to your study plan before you apply for Course Transfer. If not, your application will be cancelled. Not all requirements allow for RPL to be used towards entry.\nWeighted Average Mark (WAM): Some Course Transfer requirements ask that you successfully complete a certain overall WAM before transferring. WAM requirements are generated from Macquarie University unit taken as part of your currently admitted course.\nWeighted Average Mark (WAM): Some Course Transfer requirements ask that you successfully complete a certain overall WAM before transferring. WAM requirements are generated from Macquarie University unit taken as part of your currently admitted course.\nIf you're studying in the session before your course transfer, your application may be placed on hold until results from that session are released. This is because we require your final grades and/or updated WAM to assess whether you meet the eligibility requirements for the new course.\nDouble degrees:You must meet the entry criteria for any component of the course you are not admitted into. Please note that not all double degree combinations are permitted, the combination you choose will be assessed with your application.\nDouble degrees:You must meet the entry criteria for any component of the course you are not admitted into. Please note that not all double degree combinations are permitted, the combination you choose will be assessed with your application.\n\nWhat do I do if I don’t meet the undergraduate course transfer requirements?\nIf you don’t meet the course transfer requirements, you can apply through the standardadmissionsprocess.\n\n\nRelated Articles\nCourse Transfer FAQ\nCourse Transfer Eligibility"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Withdrawal-and-release-international-students",
    "text": "Course Changes\n27 May 2025\nKnowledge\nIf you are an international student visa holder and you want to permanently discontinue your studies at Macquarie University, you must request a Withdrawal and Release.\nCourse withdrawal:International student visa holder who wishes to return home permanently or have studied for more than 6 months of their principal course at Macquarie University and wishes to transfer to another provider.\nRelease approval:An international student visa holder wishing to transfer to another provider prior to completing six months of the principal course need to apply for a release.  A release will only be granted in exceptional and specific circumstances. Refer to the Transfer and Release Policy for International Students.\nHowever, if you would like to take a break from your study due to compassionate or compelling circumstances you can apply for aSuspension of Studies.\n\nHow can I apply for Withdrawal and Release?\nPlease submit theWithdrawal and Release formvia theService Connect Portal.\n\nWhat documents do I need to support my Withdrawal and Release application?\nDocuments for Course Withdrawal\nIf you are returning home, please provide a copy of your air ticket.\nIf you are transferring to another provider after completing six months of your principal course, please provide a copy of your unconditional offer from your new CRICOS-registered education provider.\nIf your visa has been cancelled or refused, please provide evidence.\nDocuments for Release Approval\na personal statement explaining the reason(s) for your release application including any supporting evidence\na copy of your unconditional offer from your new CRICOS-registered education provider\nYou must submit theWithdrawal and Releaseform via the Service Connect portal, along with your supporting documents, by thecensus dateto avoid any financial and academic penalty.\n\n\nHow can I obtain a release to transfer to another education provider?\nYou can apply for release by submitting aWithdrawal and Release formwith supporting documentation.\n\nHow long does it take to process my withdrawal and release request?\nApplications may take up to20 business daysto process from the day you submit your request.\n\nWill this impact my visa?\nAfter approval of your Withdrawal and Release request, the University will cancel your Confirmation of Enrolment (eCOE) and notify the Australian Government.\nPlease contact theDepartment of Home Affairsfor further information about your visa status.\n\nAre there financial and academic penalties?\nTo avoid any financial and academic penalties, please submit your application before thecensus dateof the study period.\n\nHow do I apply for a refund if my withdrawal and release is approved?\nAfter yourWithdrawal and Releaserequest has been finalised.\nAfter your withdrawal has been finalised, complete theInternational request for fee refundform.\nFor a refund of your Overseas Students Health Cover (OSHC), please contact your OSHC providerdirectly for a refund.\nFor more information about refund, please refer to theTransfer and Release Policy for International Students.\n\nCan I obtain a refund if there is credit in my account?\nIf you are an international student and you have a credit in your student account, but you are not completing your study in the current study period, you willnotbe eligible for a refund.\nThe credit will remain in your student account and will be allocated towards tuition fees for subsequent Study Periods.\nThis includes credits from:\noverpayment of fees in any study period\noverpayment of fees in any study period\nwithdrawal from one or more units after a payment has already been made\nwithdrawal from one or more units after a payment has already been made\nFor more information, please refer toInternational Fee Refund Policy.\n\nHow do I resume study after a I've stopped studying at Macquarie University?\nAfter your Withdrawal and Release application has been approved, you will need to re-apply at Macquarie University if you wish to resume study with us at some point in the future.\nPlease go to theHow to applywebpage for information on how to re-apply at Macquarie University.\n\n\nRelated articles\nSuspension of studies FAQ\n\n\n\n\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Suspension-of-studies-FAQ",
    "text": "Course Progression\n27 May 2025\nKnowledge\nSuspension of Studies (SoS)allows international students who are experiencing compassionate or compelling circumstances to take a break from study.\n\nHere are answers to some frequently asked questions about Suspension of Studies.\n\nDo I need to apply for Suspension of Studies?\nIf you are an international student and you are unable to study for the current or upcoming session due to compassionate or compelling circumstances, you must apply for a Suspension of Studies.\n\nWhat are compassionate and compelling circumstances?\nThese are circumstances beyond your control that may affect your ability to attend classes and study.\nExamples include:\nSerious medical illness or injury to you or a close family member\nDeath of a family member, such as a parent or grandparent\nA major political upheaval or natural disaster in your home country requiring emergency travel or disrupting your studies\nA traumatic experience, such as an accident\nThere are no available units for you to enrol for the current study period\n\nWhat are the eligibility requirements for a Suspension of Studies?\nThe eligibility requirements to apply for Suspension of studies are:\nYou must be admitted to a Macquarie University degree\nYou must be admitted to a Macquarie University degree\nYou haverecordedgrades (i.e., you are not in your first session or term)\nYou haverecordedgrades (i.e., you are not in your first session or term)\nYou are not on Academic Pause\nYou are not on Academic Pause\nYou do not have outstanding debts; you must pay them before you apply for SoS\nYou do not have outstanding debts; you must pay them before you apply for SoS\n\nWhen will I receive the outcome of my suspension of studies request?\nApplications may take up to20 business daysto process from the day you submit your application.\n\n\nWhen should I apply for Suspension of Studies (SoS)?\nPlease note that you must apply before the census date of the study period that you are applying for to avoid anyfinancial penalties.\n\n\nWhat are the ineligible circumstances for Suspension of Studies?\nSome circumstances will not be considered compassionate and compelling. For example:\nStudents have financial difficulty\nStudents have financial difficulty\nStudents want to change majors or course in the future study period\nStudents want to change majors or course in the future study period\nStudents failed to enrol in course by thelast date to enrolor the Late Unit Enrolment was not approved\nStudents failed to enrol in course by thelast date to enrolor the Late Unit Enrolment was not approved\nStudents have work commitments\nStudents have work commitments\n\n\nRelated articles\nSuspension of Studies\nFinancial Sanctions\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Suspension-of-studies-how-to",
    "text": "Course Progression\n31 Mar 2025\nKnowledge\nBefore you begin\n\nCheck youreligibility\nGather yoursupporting documentation, which include:Academic transcriptPassportAcademicAny communication/advise received from the UniversityEvidence of delayed outcome of appeal/advise that prevented you from enrollingCompassionate and compelling circumstance:Medical certificate/letter explaining the circumstances preventing you from studying as plannedandProfessional Authority Form (PAF)signed by medical practitioner or police/psychologist/counsellor report for traumatic experienceDeath certificate and proof of relationship with the deceasedTravel documentation (itinerary) and media reports\nAcademic transcript\nPassport\nAcademicAny communication/advise received from the UniversityEvidence of delayed outcome of appeal/advise that prevented you from enrolling\nAny communication/advise received from the University\nEvidence of delayed outcome of appeal/advise that prevented you from enrolling\nCompassionate and compelling circumstance:Medical certificate/letter explaining the circumstances preventing you from studying as plannedandProfessional Authority Form (PAF)signed by medical practitioner or police/psychologist/counsellor report for traumatic experienceDeath certificate and proof of relationship with the deceasedTravel documentation (itinerary) and media reports\nMedical certificate/letter explaining the circumstances preventing you from studying as plannedandProfessional Authority Form (PAF)signed by medical practitioner or police/psychologist/counsellor report for traumatic experience\nDeath certificate and proof of relationship with the deceased\nTravel documentation (itinerary) and media reports\nPrepare your study plan and the list of remaining units you plan to take for each study period\nSubmitSuspend Studies FormviaService Connect Portal\n\n\nRelated articles\nSuspension of Studies\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Connect-with-us",
    "text": "19 Aug 2025\nKnowledge\nAccess theService Connect Portalon your device to:\nFind answers to commonly asked questions\nAccess all your enquiries in one place\nSubmit requests for services such as Course Transfer and Change Personal Details\nChat with us online\nNeed help logging into the Service Connect Portal?\nCall theIT Service Deskon1800 674 357or +61 (2) 9850 4357\nVisit theTechBaron the ground floor of 18 Wally’s Walk"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Unit-Withdrawal-International",
    "text": "Making Changes To My Study Load\n19 Aug 2025\nKnowledge\n\nFor international students, if you wish to withdraw from a unit:\nLog intoeStudent, navigate to 'My Study' tile and select 'Manage my course'\nClick on 'Withdraw from a unit' on the left-hand side\nSelect the units you wish to withdraw from, and click 'Confirm'\nOn the next page, select 'Ok' if you wish to proceed with withdrawing from the unit(s)\nWithdraw before the official Census Date for each session to avoid an academic and financial penalty.\n\nIf you withdraw from a unitafterthe census date but on or before the Last Withdrawal Date, you will be regarded as 'Withdrawn' (W). No academic penalty is associated with a withdrawn status and this will not be included in the calculation of your Weighted Average Mark (WAM). However, you will remain financially liable for the unit.\n\nBefore you begin:\nEnsure you familiarise yourself with theAcademic Datesto be aware of the consequences of withdrawing at different times within the study period.\n\nImportant info:\nAs a student visa holder, you must follow your visa conditions to ensure you satisfy its requirements. You are required to be a full-time student and enrol in compulsory study periods to complete your studies within the stated timeframe on your Confirmation of Enrolment (CoE).\n\nIf you are experiencing academic difficulties or situations which are considered to be compassionate or compelling, you could be eligible to apply for Reduce Study Load.\n\nFor further information relating to your student visa conditions, please visitthis webpageand the related articles in the Service Connect Portal.\n\nQuick tip:\nIf you need more help understanding how to withdraw from a unit, please view ourWithdrawing from Units eStudent tutorial video.\n\nRelated articles:\nReduce Study load"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Unit-Withdrawal-Domestic",
    "text": "Making Changes To My Study Load\n19 Aug 2025\nKnowledge\n\nFor domestic students, if you wish to withdraw from a unit:\nLog intoeStudent, navigate to 'My Study' tile and select 'Manage my course'\nClick on 'Withdraw from a unit' on the left-hand side\nSelect the units you wish to withdraw from, and click 'Confirm'\nOn the next page, select 'Ok' if you wish to proceed with withdrawing from the unit(s)\nWithdraw before the official Census Date for each session to avoid an academic and financial penalty.\n\nIf you withdraw from a unitafterthe census date but on or before the Last Withdrawal Date, you will be regarded as 'Withdrawn' (W). No academic penalty is associated with a withdrawn status and this will not be included in the calculation of your Weighted Average Mark (WAM). However, you will remain financially liable for the unit.\n\nQuick tip:\nIf you need more help understanding how to withdraw from a unit, please view ourWithdrawing from Units eStudent tutorial video.\n\nBefore you begin:"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/What-are-the-application-timelines-for-Special-Approval",
    "text": "7 Aug 2025\nKnowledge\nYou’llneed tosubmityourSpecialApproval request between the opening and closingtimeframesforyourstudy period.Unfortunately, requestssubmittedoutsideof thistimeframecan’tbeprocessed, so make sure you apply on time.\nProcessingcantake up to15 business days, providedall required documentshavebeensubmitted.\nCheck the table below for the opening and closing dates for each session.\nStudy Period\nOpening Date\nClosing Date\nSession 2, 2025\nWednesday, 28 May 2025\nSunday, 3 August 2025\nSession 3, 2025\nAfter thecensus datefor Session 2 in the current Academic year\n12pm Wednesday, Week 1 of Session 3\nSession 1, 2026\nMQ College Terms\nAfter thecensus dateof the previous study period\n12pm, Wednesday prior to the start of study period\nMQBS Terms\nAfter thecensus dateof the previous study period\nMBA/MAF:  12pm Wednesday, Week 1 of the study period\nGMBA: 12pm Wednesday, prior to the start of the study period\nFMHHS\nAfter thecensus dateof the previous study period\n5pm Monday, Week 2 of the study period\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Credit-Overload-FAQ",
    "text": "Making Changes To My Study Load\n7 Aug 2025\nKnowledge\nWhat is credit overload?\nCredit Overload refers to enrolling in more than the standard maximum number of credit points for a study period. The standard maximum credit points each study period are:\nSession 1 and 2: 40 credit points\nSession 1 and 2: 40 credit points\nTerm 1 to 4: 20 credit points\nTerm 1 to 4: 20 credit points\nYou may apply for a credit overload if you have completed your first study period with the following limit:\nSession 1 and 2: up to 20 credit points\nSession 1 and 2: up to 20 credit points\nTerm 1 to 4: up to 10 credit points\nTerm 1 to 4: up to 10 credit points\nImportant:All credit overload requests require academic approval from the faculty, who will assess youreligibility.\n\nWhen should I apply for credit overload?\nYou should apply for credit overload as early as possible, at least 20 business days before the start of the requested session. This will ensure that your application is finalised before Week 1.\nIf you apply after this point, your application may not be completed before the start of the session or the last day to enrol.\n\nHow long will assessment of my credit overload application take?\nAssessment of credit overload applications usually takes up to15 business days. Complex applications may take longer.\nIn peak periods such as during enrolment or opening of class registration, assessment of applications may take up to 20 business days.\nYou can track the progress of your application in theService Connect Portal.\n\nWhat is the submission deadline for a Credit Overload?\nTo ensure your credit overload request is considered for the current or upcoming study period, submit thecredit overload form.\nImportant\nYou must submit your Credit Overload request between the opening and close timeframes for a study period as per below. Applications submitted outside of this timeframe will not be processed.\n\nStudy Period\nOpening Date\nClosing Date\nSession 2, 2025\nWednesday, 28 May 2025\nSunday, 3 August 2025\nSession 3, 2025\nAfter thecensus datefor Session 2 in the current Academic year\n12pm Wednesday, Week 1of Session 3\nSession 1, 2026\nMonday, 10 November 2025\nSunday, 1 March 2026\nMQ College\nAfter thecensus dateof the previous study period\n12pm, Wednesday prior to the start of study period\nMQBS (term-based)\nAfter thecensus dateof the previous study period\nMBA/MAF:  12pm Wednesday, Week 1of the study period\nGMBA: 12pm Wednesday, prior to the start of the study period\nFMHHS\nAfter thecensus dateof the previous study period\n5pm Monday, Week 2of the study period\nRequests submitted after the relevant close dates will not be processed.\n\nCancelling your credit overload application\nIf you change your mind and decide not to apply for credit overload, you can cancel your application.\nTo cancelbeforeyou have received your outcome, please cancel your application via theService Connect Portal.\nTo cancelafteryour application has been approved, you can withdrawfrom the approved unitsvia eStudent. Please make sure youwithdraw from the approved unit/s before thecensus date.\nIf you change your enrolment while your application is being processed, your application will be rejected.\n\nRelated articles"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/MQ-College-Late-Enrolment",
    "text": "4 July 2025\nKnowledge\nAt The College, enrolment for each Term closes at 9pm on the Sunday before each Term begins.\nHowever, during the first week of Term, students can request Late Enrolment. If approved, you will be manually enrolled into your requested units and registered for classes.\nThe number of  units you can be Late Enrolled in depends on how soon you apply:\nIf you apply before 12pm (midday) on Wednesday of Week 1,andyour application can be approved, you can be Late Enrolled intoTwo Units.\nIf you apply after 12pm on Wednesday, but before 12pm on Friday of Week 1,andyour application can be approved, you can be Late Enrolled intoOne Unit.\nAny applications submitted after 12pm on Friday of Week 1 will not be approved.\nSubmit theLate Unit Enrolment Formvia theService Connect Portal. If you need assistance, just come to The Student Hub to see an Advisor without needing an appointment any time between 9am and 4pm during the first week of Term (Ground Floor, 8 Sir Christopher Ondaatje Avenue).\n\nQuick Tip:To make sure that your application has the best chance of being approved be sure to:\nUpdate your personal address and contact details.\nClear any sanctions you may have on your account - if you have any sanctions, your request will not be approved.\nWhen you apply, make sure you check the Handbook to ensure the units you are applying for are available in the current Term.\nBe sure you write the correct Unit Code in your application, and make sure all the information is accurate.\nAlso, make sure you already meet the Prerequisites for enrolment in your selected unit. If you don't meet the prerequisites, you won't be approved!\n\nBut What If I'm Not Approved?\nIf you aren't approved for late enrolment, we recommend contacting a College Student Advisor at The Student Hub ASAP so they can help plan your remaining units. If this is during Week 1 of a Term, just come to The Student Hub to see an Advisor without needing an appointment. You can also submit an enquiry using theService Connect Portal.\nAdditionally, if you are an International Student, a rejected Late Enrolment will mean either you will be studying 1 unit (part-time) or have no units at all. If this is the case, you will now need to either apply for a Reduced Study Load (for 1 unit) or a Suspension of Studies (for no units) as soon as possible to prevent the cancellation of your eCoE and the discontinuation of your course. These applications must be submitted by the Census day (Friday of Week 3). It is highly recommended you met with a Student Advisor before submitting either application."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/How-do-I-apply-for-a-Special-Approval",
    "text": "27 May 2025\nKnowledge\nFollow these steps to get started:\n1. Check therequisites (i.e. prerequisitesorco-requisitesor if you require Permission by SpecialApproval)for the unit in theCourse Handbook.\n\n2. Check theapplication timelinesabovetomake sureyou’resubmittingyour application on time. Late applicationscan’tbe processed.\n\n3. Make sure you have ‘scheduled’ the unit in a specific study period oneStudentbefore yousubmitthe application. Youwon’tsee the uniton the application form unless you have ‘scheduled’ it.\n\n4. Prepare your supporting documents– thesemay include:\nacademic transcriptsunit guideswork experience evidence.\nacademic transcripts\nunit guides\nwork experience evidence.\n5. Submit theSpecial Approval formvia theService Connect Portal.\n\nWhat happens next?\nYou’llreceive anoutcome via your student email once your application has been reviewed and assessed.Processingcantake up to15 business days, providedall required documentshavebeensubmitted.\nIfapproved,you’llbe able to enrolin the unitviaeStudent. Important to know,to secure a spot in a class once you have enrolled in the unit,you’llneed to regularly check class registrations.\nIfdeclined,youwon’tbe able to enrol in the unit.We recommend you review other units you canstudy by referring to theCourseHandbookpage for your course.You can use detailed instructions in theCourse Guidancetool todeterminewhich units you still need to study for your course."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Special-Approval-waiver",
    "text": "Class Registration & Timetables\n15 May 2025\nKnowledge\nIfyou’retrying to enrol in a unit butdon’tmeet the listed requisites(i.e.prerequisitesorcorequisites), you may be able to request Special Approval (also known as a waiver).This process allows the University to consider your academic background, experience,or otherrelevant qualificationsto see ifyou’reready to succeed in the unit.\nYoucan findtheRequisites foreach unitintheCourse Handbook.\nYou may need to apply for Special Approval in the following scenarios:\nYoudon’tmeet a unit’s requisites butthink you are eligible to study\nYou believe you meet theunit's requisites buteStudentdoes not recognise this\nYoucan’tenrol in a unitrequiredfor your course because you have studiedan anti-requisite/NCCW unit\nThe unitrequires‘Permission by Special Approval’.\nWhy do I need to apply for Special Approval?\nForeStudenttodetermineif you meet the requisites for a unit, you must first‘schedule’ a unit via ‘Plan & Enrol’ pagefor a specific study period.\nIfyou see the message‘Unsatisfied requisite’when trying to enrol in a unit, it means youhaven’tmet the requirements(calledrequisites) to enrol in that unit.\nHere’swhat to donext:\nIf the unit is a core (required) unit in your course:To enrol in a core unit with ‘Unsatisfied requisites’,you need to complete therequisites listed on the Course Handbook.If you candemonstratethat you meet the requisites,you’llneed to apply forspecialapproval to enrol in the unit.\nIf the unit is not a core unit:It’s best to choose another unitwhereyou meet the requisites. Ifthere’sno suitableoption, you can apply forspecialapproval and explain your situation.\nQuick tip:Some units have theirownprocess:\nMMBA8155 –Advanced MBAInternship: Connecting Knowledge and ImpactMMBA8815 Form\nMQBS3000–Business InternshipMQBS3000 information page\nMQBS8090 – PACE: Student Leadership in Community EngagementMQBS8090 information page.\nView thePACE webpagefor more information.For further information, refer to the followingknowledge articles:\nWhocan apply?\nWhat are the application timelines?\nHow to apply?\nWhat are requisites?\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/What-are-requisites",
    "text": "15 May 2025\nKnowledge\nRequisiteis a requirement or condition you must meet to enrol in a unit. There aredifferent typesof requisites.\nPrerequisite-a requirement or condition you must meet before you can enrol in a unit. This could be the completion of another unit or meeting a specific conditionsuch as completion of certain credit points (cp) or specific units.\nCorequisite-a unit you must complete at the same time or before anotherunit.\nAnti-requisite/Not to Count for Credit With (NCCW) -units are considered too similar in content or learning outcomes to both count towards the same course.\nPermission by Special Approval- some units such as research projects, PACE units or special interest topics require permission to enrol even if there are no listed requisites.These also go through the Special Approval (waiver) process.\nYou can find the Requisites for each unit in theCourse Handbook."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Who-can-apply-for-a-Special-Approval",
    "text": "15 May 2025\nKnowledge\nTo enrol in a unit oneStudent, when you ‘schedule’ a unit for a specific study periodviathe ‘Plan and Enrol’ page,and you see ‘Unsatisfied requisite’,this usually means:\nYouhaven’tmet one or morerequisitesfor that unitso if you candemonstratethat you meet the requisites you cansubmitthe application.Special Approval is considered on a case-by-case basis and is only approved inspecial circumstances.You’llneed to provide supporting information or documents todemonstrateyour situation as part of the application.\nThe unit requires Permission bySpecialApprovaltoenrol;therefore,you will need to apply.\nToapply:\nYou must beadmitted into a course\nYour academic standing is notAcademic Pause orExclusion\nYou must nothave any financial sanctions due to outstanding fees."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Academic-Appeals",
    "text": "Academic Appeals\n28 Aug 2025\nKnowledge\nMacquarie University is committed to a transparent, equitable and consistent approach on decisions that affect students.\n\nWhat is an academic appeal?\nAcademic Appealsare when you request that the University review the process by which a decision was made.\nAppeals do not review the merits of that decision; instead, the focus is on the decision-making process.\nFor example, you can appeal because you believe a Grade Appeal was not conducted fairly, but you cannot appeal the outcome of a Grade Appeal because you disagree with the outcome of the Grade Appeal.\nYour appeal must clearly identify how the procedure for dealing with your issue was unfair, and detail that one or more the following grounds for appeal occurred:\nthe required procedure for making the decision was not followed\nthere was a lack of procedural fairness in making the decision\nnew information has become available that was not available at the time the decision was made and which should be taken into consideration.\nYou must provide reasoning and supporting information to show that the decision made by the University was unfair due to one of the grounds listed above. You must also demonstrate that as a result of one of these grounds existing or occurring, the decision was substantially unfair.\nYour appeal will be unsuccessful if you are unable to demonstrate that one of the grounds existed or occurred and that the decision was substantially unjust.\n\nWhat types of decisions can I appeal and how long do I have to lodge an appeal?\nYou may appeal any of the following types of decisions and the relevant timeframes are:\n10 working days\nAdmission or re-admission to a degree\nRecognition of Prior Learning (RPL)\nAcademic integrity breaches (breaches or penalty decisions, except Suspension or Exclusion)\nSpecial Consideration\nEnrolment and Leave of Absence\nWithdrawal (including Withdrawal Without Penalty)\nOutcome of a Grade Appeal\n20 working days\nAcademic Pause or Exclusion under the Academic Progression policy\nAcademic integrity breaches (Suspension or Exclusion penalties)\nExclusion under the General Coursework Rules\nSuspension of Studies\nNotice of Intent to Report\nFitness to practice requirement under the Fitness to Practice Procedure\nTermination of candidature (Higher Degree Research)\nAward of PhD, MPhil or MRes degree\nResearch degree enrolment, leave of absence and withdrawal decisions under the Higher Degree Research Variations to Candidature Policy\nPlease note that late appeals can only be accepted if you can show circumstances beyond your control which prevented you from submitting your appeal on time.\n\nWhat happens when I lodge my academic appeal?\nOnce you have lodged yourAcademic Appeal application, you will receive an automatic confirmation that your application has been received.\nWe begin processing your appeal within 10 working days and we aim to process your appeal as quickly and informally as possible. However, some appeals are more complex and may take more than 30 Working days to finalise.\nYou will be kept informed of your application progress via your student email account. We may also request additional information from you at any stage of this process.\nIn cases of Academic Pause or Exclusion, you may be invited to meet with an Academic Appeals Panel.\n\nWhat are the possible outcomes of my Academic Appeal?\nThe outcome of your Academic Appeal application will be sent to your student email address.\nIf your appeal is successful (or 'upheld'), there may be several possible outcomes:\nThe original decision may be overturned, and your original request sent for action to the appropriate team/sThe original decision may be sent to a new decision-maker in the relevant area for reconsideration, following appropriate processes. This means that a new decision will be made, through it is important to note this does not mean that a different result will be reached; for example, a successful appeal may not necessarily result in your candidature being reinstated.\nThe original decision may be overturned, and your original request sent for action to the appropriate team/s\nThe original decision may be sent to a new decision-maker in the relevant area for reconsideration, following appropriate processes. This means that a new decision will be made, through it is important to note this does not mean that a different result will be reached; for example, a successful appeal may not necessarily result in your candidature being reinstated.\nIf your Academic Appeal is unsuccessful (or 'dismissed'), you may also have further options outside of the University. Agencies that you may consider include:\nNSW OmbudsmanAustralian Human Rights CommissionAnti-Discrimination Board of NSWAudit Office of NSWNSW Independent Commission Against CorruptionInformation and Privacy Commission NSW\nNSW Ombudsman\nAustralian Human Rights Commission\nAnti-Discrimination Board of NSW\nAudit Office of NSW\nNSW Independent Commission Against Corruption\nInformation and Privacy Commission NSW\n\nFurther information\nIf you are uncertain of the procedures or need help to submit your appeal, you can contact the Complaints, Appeals and Misconduct team onAcademic_Appeals@mq.edu.au. Or contactStudent Advocacyfor advice.\nRelated articles\nGrade Appeals FAQ"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Grade-Appeal",
    "text": "Academic Appeals\n21 Jan 2025\nKnowledge\nIf you are considering appealing your grade, you must submit aGrade Appeal formwithin 15 business days of official notification of your final grade.\n\nHow do I prepare for a grade appeal?\nRead theAssessment PolicyandAssessment Procedure.\nRead the information on theAppealing a University decisionwebpage.\n\nShould I review my exam script?\nBefore you lodge an application for Grade Appeal, you should make a booking to review your exam script.\nThis is important for claims of administrative errors during final exams.\n\nHow do I register to view my exam script?\nMacquarie Business School\nPlease register for an exam script view using theMQBS registration form.\nPlease advise us of the specific unit you are seeking to view the exam script(s) for.\nMacquarie Business School will send you an email reminder prior to your registered script viewing date.\nPlease see the scheduled script viewing dates in this form\nFaculty of Arts, Faculty of Medicine Health and Human Sciences and Faculty of Science and Engineering\nPlease contact your unit convenor to organise a script viewing.\nPlease note:\nYou cannot view exam scripts for units with 'I' or 'IS' results as these units have not yet been finalised.\nIf you have been awarded a supplementary exam, only the supplementary exam can be viewed, and the original exam is null and void.\nYou may need to keep copies of your emails as evidence in your appeal.\nMacquarie College\nPlease send an enquiry viaService Connect Portalwith the subject 'Final Exam Script Viewing' and include the Unit Code in your request.\n\nWhere can I get assistance with my grade appeal?\nYou can contactStudent Advocacyfor assistance with your grade appeal.\nStudent Advocacy provides free, confidential and independent information and advice about University policies and procedures.\n\nWhere can I get support for my wellbeing?\nPlease contactStudent Wellbeingif you need personal support.\n\nRelated articles\nResults\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Exam-Support",
    "text": "Exam Support\n26 Dec 2024\nKnowledge\nAssessments and exams are a stressful but crucial part of your course. At Macquarie University, we offer tons of support, guidance and information to help you.\nCheck out ourExam Preparation guidefor information on how to make sure you are prepared for your exams to maximise your marks.\nYou can find some useful resources inStudy Supporton how to get assistance with your assessments, find study spaces on campus, and access past exam papers.\n\nQuick tip:check out ourstudent blogsfor study tips and dealing with exam stress.\n\nRelated article\nExam Clash\nExam Timetable\nExam Changes"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Exam-open-book",
    "text": "Exam Support\n26 Dec 2024\nKnowledge"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Opal-Concession",
    "text": "Campus Cards & Opal Concession\n28 Aug 2025\nKnowledge\nAs a Macquarie domestic student studying full time, you may be eligible for concession travel with Transport for NSW.\nQuick tip:If you are studying online or external mode units, this may impact your eligibility. You can check your eligibility on theTransport for NSWwebpage.\nTo find out more, please readTransport Concession.\nRemember: You no longer need to submit a declaration each year. If you have previously submitted your declaration to Macquarie, it will continue to apply for the remainder of your studies if you meet the eligibility requirements"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Transcript-FAQ",
    "text": "22 July 2025\nKnowledge\nYour academic transcript is a document which includes units, results, credit points, course completion and/or conferral of award details.\nIf you are studying with us, you can access yourunofficialtranscript viaeStudent.\nIf you require anofficialtranscript, please note the following information.\nImportant:If you were a student before 2008, please refer to theTranscript request: Before 2008.\nFurther information can be found onAcademic transcripts.\n\nHow long does it take to get my transcript?\nTranscripts take up to 3 business days to be processed.\nOnce you have made your payment, the processing times apply as follows:\nCollection from Friday, for example:\norder 2.00 pm Tuesday – available Friday\norder 4.00 pm Wednesday – available Friday\norder 10.00 am Thursday – available Friday\nCollection from Wednesday, for example:\norder 12.00 pm Friday – available Wednesday\norder 3.00 pm Monday – available Wednesday\norder 9.00 am Tuesday – available Wednesday\n\nIf you studied at the Sydney Kindergarten Teachers College (SKTC), Nursery School Teachers College (NSTC) or Institute of Early Childhood Studies (IECS) prior to 1990, your transcript request may also take more time to process as this is historical information requiring collation.\n\nHow can I organise a third party to collect my transcript for me?\nTo have a nominated third party collect document(s) on your behalf you will need to select this option in the online gateway at the time you purchase your transcript. Make sure to advise your third party they will need to provide an official form of photo identification at the time of collection (e.g. driver licence or passport).\n\nRelated article\nTranscript request: Before 2008\nThird party authority"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Reduce-Study-Load-INTL-how-to-apply",
    "text": "International Student Requirements\n10 July 2025\nKnowledge\nAs an international student visa holder, if you cannot maintain a full-time study load or complete your course within the time specified on your Confirmation of Enrolment (CoE), you must apply for aReduce Study Loadbefore thecensus dateof the study period to avoid anypenalties.\nNo Reduced Study Load applications will be accepted after theLast Withdrawal Without Fail date.\n\nBefore you begin\n\nYou must be enrolled for your application to be considered.\nCheck youreligibility.\nList the units in Reduce Study Load application that you plan to study for the current study period.\nGather your supporting documentation and submit it with your application:\nAcademic reason\nProvide a copy of the email correspondence from the faculty or include the case number where a reduced study load was recommended.\nCompelling reason\nProvide the unit codes that are not available for the current study period or include the case number where the outcome was delayed.\nCompassionate reason\nA completeProfessional Authority Form (PAF)signed by a medical practitioner explaining the circumstances that impacted your ability to study full load.\n\nAlong with the other supporting documents such as Death certificate and proof of relationship with the deceased.\n\nSubmit theReduce Study Load formvia theService Connect Portal\n\n\n***ImportantYou must remain enrolled infull-time study loaduntil your application has been finalised.  ***\n\n\nRelated articles\nReduce Study Load FAQ\nSuspension of Studies\nFull-time study load for international students\nConfirmation of Enrolment"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Reduce-Study-Load-FAQ-INTL",
    "text": "International Student Requirements\n10 July 2025\nKnowledge\nIf you are an international student visa holder, you must:\nmaintain full study load, and\ncomplete your course within the time specified on yourConfirmation of Enrolment (COE)\nHowever, you may be eligible to reduce your study load if you experience academic difficulties, or circumstances which are compassionate and compelling in nature. We encourage you to seek support from various studentsupport servicesavailable at Macquarie University.\n\nYou are not required to apply for a reduced study load if:\nYou are in your final study period and have fewer than 40 credit points remaining to complete your course, or\nYou were provided with a Study Plan at the time of admission that already includes a reduced load in specific study periods.\n\nWhat is a full study load for an international student visa holder?\nA full-time load for international students is:\nFor Macquarie University session-based students: 40 credit points (4 units) in each compulsory study period (Session 1 and Session 2)\nFor Macquarie University term-based students: 20 credit points (2 units) each term.\n\nWhat are the circumstances to apply for reduce study load?\nThere are circumstances beyond your control that may affect your ability study full load, and you must provide evidence to support your application:\nAcademic reason\n\nReceived guidance: You have received advice from the faculty to reduce study load.\nImplementation of academic intervention strategies: Your academic standing is monitored enrolment, and you are required to reduce study load to assist with your academic performance.\n\nCompelling reason\n\nRequired unit unavailable in specific study period: You have no other units available to enrol in to maintain a full study load including flexible zone and electives.\nDelay in the outcome Appeal/Advice: For example, if your grades are not finalised in time, it may impact your ability to enrol in a full load.\n\nCompassionate reason\n\nSerious Illness: A health problem that is serious and impact your ability to study full load.\n\nTraumatic Experiences: These are very stressful or shocking events that cause emotional pain, such as accidents, natural disasters, or experiencing violence and impact your ability to study full load.\n\nBereavement of Close Family Members: This means the sadness and mourning someone feels when a close family member and impact your ability to study full load.\n\nPolitical Unrest in Home Countries: This refers to a situation where there is conflict, violence, or instability in your home country and impact your ability to study full load.\n\nWhat are the ineligible circumstances for reduced study load?\nSome of the ineligible circumstances for reducing your study load include:\nStudent having financial difficulty.\nStudents want to change majors or course in the future study period.\nStudent failed to enrol in your course by thelast date to enrolor the Late Unit Enrolment was not approved.\nStudent have work commitments.\nRecognition Prior Learning Application was not approved\n\nWhen should I apply for a reduced study load?\nYou must apply for aReduce Study Loadbefore thecensus dateof the study period to avoid anypenalties. No Reduced Study Load applications will be accepted after theLast Withdrawal Without Fail date.\nYou may consider submitting aWithdrawal Without Penaltyform if you meet the eligibility criteria.\n\nHow long will my application take?\nApplications to reduce your study load generally take 20 business days to be processed.\n\nWhat happens if my application to reduce my study load is not approved?\nIf your application for a reduced study load is not approved, you must continue to study a full load in order to complete your course as per your Confirmation of Enrolment (CoE).\nIf a student decides to reduce their study load without approval, their request for a COE extension may not be approved, potentially preventing them from completing their course.\n\n***ImportantYou must remain enrolled infull-time study loaduntil your application has been finalised.  ***\n\nRelated articles\nHow to apply for Reduce Study Load\nSuspension of studies\nFull-time study load for international students\nConfirmation of Enrolment"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Extension-of-Confirmation-of-Enrolment-FAQ",
    "text": "International Student Requirements\n10 July 2025\nKnowledge\nYou can apply for an extension of your CoE if you’re applying for a student visa extension and meet at least one of the following criteria:\nyou have an approved Reduced Study Load (RSL) or Suspension of Studies (SoS) from previous study period\nyou have failed units or been placed on Monitored Enrolment that prevent you from completing your studies within the duration of your current CoE\nyou are experiencing compassionate or compelling circumstances, and you can provide evidence to support this assessment.\nYour CoE application will not be processed if:\nyou have a valid CoE with more than 3 months remaining until your visa expires\nyour results for the current study period have not been released\nyour contact details (current Australian address and mobile number) are not up to date in eStudent\nyou did not maintain a full-time study load during a compulsory study period, and you did not have prior approval from Macquarie University (an approved Suspension of Studies or Reduced Study Load.)\nyou do not have compassionate or compelling circumstances, or you are unable to provide supporting evidence\nyou have outstanding debts."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Extension-of-Confirmation-of-Enrolment-how-to-apply",
    "text": "International Student Requirements\n10 July 2025\nKnowledge\nTo apply for an Extension of Confirmation of Enrolment (CoE), follow the steps below:\nPrepare your study planWork out the remaining units you will need to take to complete your course. You can find detailed information available in theCourseGuidanceTool if you're unsure of how to work out your remaining units.\nGather supporting documentsYou’ll need to attach the following documents with your CoE application:\nPassportif you did not have an approved Reduced Study Load or Suspension of Studies for specific study period(s), you’ll need to provide supporting documents that demonstrates compassionate/compelling reasons for not maintaining a full-time load.\nPassport\nif you did not have an approved Reduced Study Load or Suspension of Studies for specific study period(s), you’ll need to provide supporting documents that demonstrates compassionate/compelling reasons for not maintaining a full-time load.\nSubmit yourExtension of Confirmation of Enrolment (CoE)\n\n***If you’re planning to apply for special approval, recognition of prior learning, a reduced study load, or suspension of studies, which may affect your current study plan, you must include this information in your application. ***\nYou can provide these details and relevant case reference numbers as an attachment.\nWe can only issue your CoE once your study plan has been confirmed and approved by your faculty. Once your CoE is issued, no further changes can be made to the study plan.\n\nRelated articles\nKnowledge Articles -Student Visa Conditions\nWebsite -Student Visa Conditions"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/New-Zealand-Special-Category-Visa-Holder-SCV",
    "text": "27 Mar 2025\nKnowledge\nIf you are a New Zealand citizen on a Special Category Visa (SCV) or have previously held a SCV, you may be eligible to borrow the cost of your tuition fees from the Commonwealth Government. If you meet the eligibility requirements and you borrow your fees, you will be required to repay theamount you borrow via theAustralian Tax Office (ATO).\nTo be eligible, you must meet the long-term residency requirements and be living in Australia for the duration of your course of study.\nYou can find answers to frequently asked questions about New Zealand SCV holder below.\n\nHow do I know if I am a New Zealand Special Category Visa (SCV) holder?\nIf you are unsure if you are aNew Zealand Special Category Visa holder, you will be able to check this on theVisa Entitlement Verification Online (VEVO)system, from theDepartment of Home Affairs(DHA).\n\nWhat do I need to do to show that I am eligible?\nIf you believe you meet all the SCV criteria, and you would like to request HELP assistance, you will need to complete all steps below before the nextcensus date:\nComplete theResidency Verificationform\nProvide evidence that you currently hold a NZ Special Category Visa (SCV) i.e. a copy of your NZ passport\nShow evidence that you have been ordinarily resident in Australia for at least 10 years, and that you were under the age of 18 without a spouse or de facto partner when you first began to be ordinarily resident in Australia, and\nShow evidence that you have been in Australia for at least:\na total of eight out of the past 10 years; anda total of 18 months out of the last two years\na total of eight out of the past 10 years; and\na total of 18 months out of the last two years\n\nWhat types of evidence can I provide to establish that I am eligible?\nYou will need to show that you have been ordinarily resident in Australia by showing continuity of residency.\nExamples of proof include:\nAnInternational Movement Records(the most comprehensive form of evidence available from the Department of Home Affairs, allow 28 days for processing)\nAustralian academic transcripts (including VET transcripts) dated when you were a minor\nSchool reports or certificates\nEnrolment papers from when you were a minorAustralian proof of age card from when you were a minorAustralian student ID card or concession cardStamped passportPay slips or payment summaries from when you were a minorCertificate of application for a Tax File Number (TFN), TFN advice or notification of assessment of income tax dated from when you were a minor\nAustralian proof of age card from when you were a minor\nAustralian student ID card or concession card\nStamped passport\nPay slips or payment summaries from when you were a minor\nCertificate of application for a Tax File Number (TFN), TFN advice or notification of assessment of income tax dated from when you were a minor\nImportant:You must provide all required documents and be assessed as eligible by the next relevantcensus dateto be able to defer your fees for the session. Otherwise, you must make full payment of fees upfront for that session.\nFurther information about upfront payment can be found onHow to Pay.\n\nI have previously held a SCV, how do I prove this?\nAlong with the above evidence, the most accurate form of evidence is anInternational Movements Recordavailable at no cost from theDepartment of HomeAffairs(DHA).\nPlease be aware that it may take up to 28 days for your application to be completed.\nYou can also submit a previous copy of aVEVOrecord and you must also establish that you meet the residency requirements.\n\nWhen will I know the outcome of my application?\nYou will receive an email with the outcome of your NZ SCV application within 15 business days from the date of submission.\n\nDo I need to submit a new request for HELP (eCAF) if my application is successful?\nYes, you must submit a new request for HECS-HELP / FEE-HELP via aneCAFform ineStudent.\n\nFurther information can be found on the Australian government’sStudyAssistwebsite.\n\nRelated Articles\nResidency Verification – FAQ\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Residency-Verification-How-to-verify",
    "text": "27 Mar 2025\nKnowledge\nBefore you begin\nCheck yourresidency status\nGather your supporting documentation andcertify your documents(if applicable)\nCheckkey dates\nComplete theResidency Verification form\n\nRelated Articles\nResidency Verification – FAQ\nResidency Verification – Permanent Residents (Non-humanitarian) or New Zealand Citizens\nResidency Verification – Australian citizen\nResidency Verification –PermanentResident Humanitarian\nResidency Verification –Former Permanent Resident (Humanitarian) Visa holder"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Residency-Verification-Permanent-Residents-Non-humanitarian-or-New-Zealand-Citizens",
    "text": "29 Jan 2025\nKnowledge\nTo change or verify your residency, you must inform us by submitting theResidency Verification formwith appropriate documentation prior to the next census date of your study period.\nThis article has answers to questions about Residency Verification for Permanent Residents (Non-humanitarian) or New Zealand Citizens.\n\nHow do I update my residency status to Permanent Resident (Non-humanitarian) or New Zealand citizen?\nIf you have become a Permanent Resident (Non-humanitarian) or New Zealand citizen, you must submit one of the following via theResidency Verification form:\na copy of the photo page of your passport or\na copy of your ImmiCard University staff will verify your residency status onVEVOand if approved, you will be advised to submit a new eCAF\n\nCan I borrow the cost of my tuition fees?\nNo, as a Permanent Resident (Non-humanitarian) or a non-eligible New Zealand citizen, you cannot borrow the cost of your tuition fees from the Australian Government.\n\nWhat if I have already paid my fees at the international rate?\nIf you have paid international tuition fees upfront and your residency status has been successfully changed to Permanent Resident or New Zealand citizenbeforethe nextcensus date, you will be eligible for a refund if there is a difference between the international and new domestic rates.\nAs such, you can either request a refund of any credit amount. Please seeRefund Request for Domestic StudentsorRefund Request for International Studentsfor information on refunds.\n\nImportant:if there is any outstanding amount, you are required to pay the difference.\n\nRelated Articles\nResidency Verification – FAQ\nResidency Verification – Australian citizen\nResidency Verification –PermanentResident Humanitarian\nResidency Verification –Former Permanent Resident (Humanitarian) Visa holder\nHow to update my residency status?"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Transcript-request-Post-2008",
    "text": "24 Jan 2025\nKnowledge\nIf you are a Post 2008 student and you would like to request your Academic Transcript, please follow the instructions below:\nGo toTranscript Payment forms\nLogin using your SID and password\nOnce you've logged in click on \"My Account\"\nSelect \"Academic Document Request\"\nSelect either \"Academic Record Request Post\" or \"Academic Record Request Pickup\"\nComplete the form and pay for your Academic Transcript\nImportant\nYou will find answers to frequently asked questions about Academic Record Request for Post 2008 students below.\nIneed to send my transcript to an Australian organisation or institution.\nTo have your transcript sent to an Australian organisation or institution, you must complete theDeliver Macquarie University Transcript to Australian Institution formthrough the payment portal.\n\nCan I get a digital copy of my transcript?\nIf you would like to request a digital version of your Academic Record Request, please complete theMy eQuals Record Request formand pay.\n\nI need my transcript shared withWorld Education Services (WES).\nAll post-2008 students must release their Academic Transcript to WES viaMy eQuals.  Once you have received your digital document, you can then share it with WES via 'Share to an Organisation' from My eQuals.\n\nRelated articles\nTranscript FAQ\nTranscript request: Before 2008\nThird party authority"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/What-is-the-Commonwealth-Prac-Payment-CPP",
    "text": "Commonwealth Support\n27 Aug 2025\nKnowledge\nThe Commonwealth Prac Payment (CPP) provides financial support during your mandatory placement periods. Eligible students receive $331.65 per week (2025 rate) to help manage living costs while completing required placements in nursing, midwifery, teaching, or social work.\nCPP payments are taxable income. You must declare it to the ATO\nCPP may affect Centrelink payments. You must declare it to Services Australia\nYou must return payments for incomplete placements\nYou must notify us of any changes to your eligibility\nPayment durationThe CPP supports you for the minimum placement period required for your profession.\nNursing (Bachelor/Masters) 20 weeks maximum\nTeaching (Bachelor) 16 weeks maximum\nTeaching (Masters) 12 weeks maximum\nMidwifery (Bachelor/Masters) 26 weeks maximum\nSocial Work (Bachelor/Masters) 26 weeks maximum\nFor further information and to lodge an application for the CPP, please visit this linkhttps://cpp.hes.edu.au/.\nFurther questions can be directed tocommonwealthpracpayment@education.gov.au.Related ArticlesAm I eligible for the Commonwealth Prac Payment (CPP)?How do I apply for the Commonwealth Prac Payment (CPP)?How do I appeal the outcome of my Commonwealth Prac Payment (CPP) eligibility?"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/How-do-I-apply-for-the-Commonwealth-Prac-Payment-CPP",
    "text": "Commonwealth Support\n27 Aug 2025\nKnowledge\nGather your supporting documentation and complete the online application form available fromcpp.hes.edu.au.Ideally, submit your application at least 4 weeks before your placement begins and check your student email for notification about your application outcome.For Income Support recipients:\nCentrelink Payment Details or Income Statement\nFor Need to Work Test:\nPayslips showing 60+ hours worked over 4 weeks\nFor Income Test:\nEvidence your income doesn’t exceed $1,500/week\nImportant information\nCPP payments are taxable income and must be declared to the ATO\nCPP may affect Centrelink payments – you must declare it to Services Australia\nIf you withdraw from your unit , you must return the portion of payment for incomplete placement weeks\nYou must notify the university of any changes to your circumstances that affect eligibility\nFurther questions can be directed tocommonwealthpracpayment@education.gov.au.Related ArticlesWhat is the Commonwealth Prac Payment (CPP)?Am I eligible for the Commonwealth Prac Payment (CPP)?How do I appeal the outcome of my Commonwealth Prac Payment (CPP) eligibility?"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/How-do-I-appeal-the-outcome-of-my-Commonwealth-Prac-Payment-CPP-eligibility",
    "text": "Commonwealth Support\n27 Aug 2025\nKnowledge"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Am-I-eligible-for-the-Commonwealth-Prac-Payment-CPP",
    "text": "Commonwealth Support\n27 Aug 2025\nKnowledge"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Financial-Sanctions",
    "text": "Fee Sanctions\n2 June 2025\nKnowledge\nWhat is a financial sanction and what does it do?\nA financial sanction is a restriction applied to a student's account that may impact their ability to\naccessexam results\nrequest academic transcriptsor other official documents\nenrol in new units\ngraduate\nThere are six financial sanction codes, namelyDWO, INF, SSA, LPF, LFD, and FIN.\nFinancial sanctions may be applied to a student's account when they fail to pay their outstanding fees and other charges as shown in their eStudent account.\n\nWhat should I do if there is a financial sanction on my account?\nIf your sanction is either DWO or FIN, please reach out to the Student Debt Management team at 02 9850 7230 to determine how these sanctions can be lifted.\nIf your sanction is one of INF, SSA, LFD and LPF,  you must pay any outstanding fees as shown on your eStudent account. You can pay your fees througheStudentvia theMy Finances.For information about payment methods, please refer to theHow to Pay page.\nPlease be advised that it may take upto three business days for sanctions to be lifted from your account."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Statement-of-Outstanding-Charges-Tax-Invoice",
    "text": "9 May 2025\nKnowledge\nWhat is a Statement of Outstanding Charges/Tax Invoice?A statement of outstanding charges/tax Invoice is an official university document showing your current outstanding fees.\n\nWhy do I need a Statement of Outstanding Charges/Tax Invoice?\nThe statement of outstanding charges/tax Invoice provides a list of outstanding fees in your account.This official document can be provided to third parties—such as banks, employers, and sponsors—to confirm the fee amounts you are required to pay to Macquarie University.\n\nHow can I get my Statement of Outstanding Charges/Tax Invoice?\nLog in toeStudentwith your OneID account.\nSelectMy Study, then clickManage My Courses.\nGo toSelf-Service Report.\nClick onRequestbutton againstStatement of Outstanding Charges/Tax Invoice.\nThe system will send theStatement of Outstanding Charges/Tax Invoiceto your official university student email address."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Loan-Application-UG-PG",
    "text": "7 May 2025\nKnowledge\nStudents enrolled at Macquarie University and studying onshore may apply for a student loan up to $2,000to support their education-related expenses.\nTo find out if you are eligible for a Student Loan, please refer toStudent Loan Policy and Procedures.\nIf you are eligible, fill out theLoan Application. You will need to provide information about your situation, including but not limited to your income and expenses.\nIf you would like to discuss support for personal concerns, such as emotional or mental health; a disability or health condition that impacts your study; concerns about a legal, safety or other issue; contactStudent Wellbeing."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Refund-Request-Domestic",
    "text": "18 Mar 2025\nKnowledge\nIf you are a domestic student andyour account is in credit, please log in to the Service Connect Portal and submit theDomestic refund form.\nIf you cannot log in to the Service Connect portal, please submit an enquiry using theSubmit an enquirybutton below."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Paying-my-student-fees",
    "text": "18 Mar 2025\nKnowledge\nChoose a payment option that is right for you to ensure that you don't miss a payment!\nVisitHow to Paypage for information on all payment methods with related instructions.\nImportant:\nCard payments may incur a surcharge and may take up to 1 day to be reflected on your student account.\nBPAY payments may take up to 3 business days to be reflected on your student account.\nOverseas payments may take up to 10 business days to be processed by your bank before it is reflected on your student account.\nPayment made through Convera can be tracked via theConvera Track Website."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Scholarship",
    "text": "26 Dec 2024\nKnowledge\nMacquarie has one of the most generous international scholarship programs in Australia. This includes a wide variety of long and short term opportunities for international students.\nThe range of scholarships available can depend on the country you are from, with other eligibility factors including your field of study and academic or sporting achievements.\n\nYou can find answers to frequently asked questions about scholarships below.\nWhat scholarships are available to me?I have questions about the scholarship application process\n\nI missed the deadline to accept my scholarship. What happens now?\nThere are limited number of scholarships, so we encourage you to accept your offer early to avoid disappointment. Some scholarships have acceptance deadlines which you must meet to be eligible for the scholarship.\nIf you miss out on the deadline or require further information, contact Future Students team atstudy@mq.edu.au.\n\nCan I defer my scholarship?\nMost scholarship offers cannot be deferred; however, you may be able to reapply in the subsequent round.\nCheck the details of the individual scholarship to see your options.\n\nHow are domestic student scholarships applied?\nScholarship payments are processed after the scholarships are reviewed at the end of each study period.\nDirect scholarship payments will be made into your bank account by the end of April and September.\nFee reduction scholarships are progressively credited to your tuition fees once you have enrolled in your units for the relevant study period(s).\nYou can check that your scholarship has been applied, in eStudent under 'View student finances', click on 'Click Here for Details' next to 'My Sponsorships/Scholarships' section.\n\nWhen will international student scholarship be paid?\nInternational student scholarships are generally fee reductions where payment is processed close to the start of each study period.\nTwo weeks before your payment due date, you can check that your scholarship has been applied. To do this, go to eStudent under 'View student finances', click on 'Click Here for Details' next to 'My Sponsorships/Scholarships' section.\n\nHow do I update my bank details for my scholarship payment?\nIf your scholarship payment is via direct payment into your bank account, you will need to enter your banking details in eStudent, through the following steps:\nSelect 'View Student Finances'\nFrom the left menu, select 'Preferences'\nIn Payment Methods, select 'Electronic Funds Transfer\nIn Bank Transfer Method, select BSB, the code must be 6 digits only\nQuick tip:Use the following format and do not include any other characters or blank space between numbers.\nExample: BSB 123456 Account: 12345678\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Other-Student-Services-Links-Feedback",
    "text": "26 Dec 2024\nKnowledge\nTech Bar\neStudent\niLearn\nHandbook\nLibrary\nCampus Security\nCampus Map\nKey University Dates\nSports & Aquatic Centre\nAccommodation\nStudent Wellbeing\nFeedback"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Exam-Clash",
    "text": "Exam Support\n25 Sept 2024\nKnowledge\nClash means two Final Examinations overlapping for any period of time, or with less than one-hour break between two Final Examinations on the same day. Students will be notified by the Examinations Office of arrangements that will be made if their exams clash.\nIf the clash occurs between a Final Examination and a take-home examination, the Final Exam will take precedence. Apply forSpecial Considerationfor your take-home examination.\nI have two exams on the same day - Can I move one of these exams?\nNo. If you have two exams scheduled on the same day at different start times (for example, at 9.00am and 1.30pm), you cannot move these exams and you are expected to sit both.\n\nQuick tip:If you experience serious and unavoidable difficulties at exam time or when assessment tasks are due, you can consider applying forSpecial Consideration.\n\nRelated article\nSpecial Consideration"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Results",
    "text": "27 Nov 2024\nKnowledge\nYou will receive your results in an email between 9am and 3pm on results release day to your official student email account.\nImportant:Result emails are sent in batches throughout the day, so students studying the same units may not receive their results at the same time. Please check theCalendar of datesfor results publication date.\n\nQuick Tip:Your results are available viaeStudentfrom 3pm.\n\nPlease find below answers to frequently asked questions about results release below:\nHow can I access my results via eStudent?\nTo access your results fromeStudent​:\nYou can view your results under the 'My Study' tile using the 'Overview' tab. Please scroll down to your admitted course.​\nYou can also view your results in the 'My Study' tile by requesting an internal Academic Transcript from Self Service Reports.\n\nWhy have I not received my results?\nThe two most common reasons for you not receiving your results are:\nyour results have not been sent yet, or\nyou have an outstanding debt or sanction\n\nHow do I know if I have a sanction preventing my results release?\nTo check whether you have an outstanding debt or sanction, please follow the steps below:\nLog intoeStudentand click on 'My Details' tile\nClick on 'Sanctions' tab on the left-hand side\n\nWhat do I do to lift my fee sanction?\nIf you have a fee sanction, you must pay the fee amount to resolve the sanction.\nImportant:Payments can take up to 3 business days to clear and for your sanction to be lifted. Please plan ahead and pay in advance.\nThere are a few different payment options, please seeHow to Payfor more information on payment methods.\n\nWhat other sanctions will prevent me from receiving my results?\nYou may have other sanctions such as USI or Residency Verification sanctions that prevent you from receiving your results. You must resolve any sanctions before you can access your results.\n\nI have resolved my sanction. How can I view my grades?\nOnce you have resolved your sanction, you will need to access your results viaeStudentas you will not receive a result outcome email in your student email account.\n\nTo appeal your grade, please seeGrade Appealbefore applying. Please note that you must apply within 15 business days of receiving your results. Any questions about specific unit grades or marks should be directed to the unit convenor outlined iniLearn.\nIf you are completing your degree, please viewCompletion Letterfor more information.\n\nRelated articles\nGrades\nGrade Appeal"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Qualification-Check-double-degree",
    "text": "Graduation\n15 Oct 2024\nKnowledge\nIf you are an undergraduate student enrolled in a double degree, and you want to exit with a single degree, please apply for course transfer before the final year of your study.\nIf you are unable to transfer, please submit aQualification Check formby the Census Date of your last study period stating the single degree.\nIf you are a postgraduate double degree student and you want to exit with a single degree component, please submit aQualification Check formnominating the degree to be assessed against.\n\nRelated articles\nQualification Check"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Expect-to-Complete-PG",
    "text": "Course Progression\n25 Sept 2024\nKnowledge\nTo exit with a single degree component of your double degree studies, apply to Course Transfer before your final year of study.\nIf you are unable to course transfer, please submit aQualification Check formby the Census Date of your final study period. Be sure to note which single degree you want to be qualified with.If you miss theCensus Date, please submit an enquiry via theService Connect Portalrequesting to exit.\nIf you meet the course requirements at the end of your final session, you will be qualified for that degree and passed. You cannot make any further changes to your course after this.\n\nHow do I exit with a lower degree than the one I am admitted into?\nIf you are a postgraduate Masters student and you want to exit with a relevant eligible Graduate Certificate or Graduate Diploma for your course, you need to submit aQualification Check form.Please nominate the exit award as the course that you want to be assessed against.If the exit award you want to qualify with is not available, submit an enquiry.\nQuick tip: If you want to be admitted into the single course component you didn't qualify with, you will need to reapply as a new applicant.\n\nRelated articles\nQualification Check"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Grade-Appeal-MQ-College",
    "text": "Academic Appeals\n9 Dec 2024\nKnowledge\nIf you are considering appealing your grade, you must submit aGrade Appeal formwithin 15 business days of official notification of your final grade.\n\nHow do I prepare for a grade appeal?\nRead theGuide to Grade Appeals. You should read this in conjunction with theAssessment PolicyandAssessment Procedure.Read the information on theAppealing a University decisionwebpage.\n\nShould I review my exam script?\nBefore you lodge an application for Grade Appeal, you should make a booking to review your exam script - this is important for claims of administrative errors during final exams. Macquarie University College students should submit aMQ College Script Viewing Requestto view their script. This form will be available for 10 working days after the publication of results for the current Term. Information on the date, time, and location of the script viewing will be sent to your student email.\n\nBefore you begin:- Check if you are eligible.- Find out the application dates.- Read more information on how to apply.- Need assistance with your appeal?Request Advocacy support- Looking for Wellbeing support?Request Student Wellbeing support"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-error-previously-completed-may-be-eligible-advanced-standing",
    "text": "1 Oct 2024\nKnowledge\nIf you get this error message when you are trying to add a major/minor to your new course, please submit theChange of Major formand add a note indicating that you cannot add the major/minor because of this error.\nIf you get this error message when trying to add a specific unit to your study plan, please submit theEnrolment Support formwith screenshots. Make sure you indicate which unit you are trying to add."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Course-Guidance-course-changes-undergraduate",
    "text": "Course Changes\n25 Nov 2024\nKnowledge\nIf you want to change your degree but are not sure how this might affect your studies, check out the Course Changes section of theCourse Guidance Tool.\nThis tool will help you determine and understand any impacts a Course Transfer may have on your degree, including information on eligibility requirements and credit transfer to your new degree.\nFor general information about the Course Transfer process, please see theCourse Transfer FAQon this topic."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Change-of-major-FAQ",
    "text": "Course Changes\n14 Oct 2024\nKnowledge\nThechange of major, minor, or specialisation formallows you to request a change to one or more of the following:\nMajors (qualifying majors and/or flexible zone majors)\nMinors\nSpecialisations (undergraduate and postgraduate degrees)\nYour course requirements can be found in the Course Handbook, which will provide you with details on your admitted course, including whether there are any major, minor, specialisation, and/or concentration requirements.\nInformation about course requirements and the Curriculum Architecture can also be found in theCurriculum Architecture Policy.\n\nWhat is required for a minor?\nA minor is a sequence of undergraduate units drawn from a major or specialisation but with a smaller volume of learning requirement.\nA minor must be 40 credit points, of which 20 credit points must be completed at 2000 level or above.\n\nWhat is required for a major?\nA major consists of 80 credit points, of which 30 credit points must be at 3000 level. The list of eligible qualifying majors for a degree are included in the course’s 'major schedule' in the Course Handbook.\n\nWhat is flexible zone major?\nThe Flexible Zone major may be chosen from all available majors listed in the Handbook.\nThe major will be added from the year that you commenced your course.\nIf the major is not available in your course year but is available in a future year, the major will be added from the first available year after your course commencement year.\n\nCan double degree students change major?\nIf you are admitted into a double degree, you will need to complete the core zone of each component single degree. Your major, minor, and specialisation requirements will be determined by the requirements of the individual single degrees.\nThere are unit sharing restrictions within double degrees, which mean that students are unable to complete a specialisation or major where it is possible to choose a combination of units which share more than 50 per cent of credit points in common 1000 level and above with:\na major or specialisation from the other course, or\nthe core zone of the other course (outside any major or specialisation)\n\nCan postgraduate students change major?\nMasters degrees may require completion of a specialisation in the core zone.\nIn postgraduate specialist courses, specialisations will constitute 50 per cent of a course’s core zone units.\nWhere applicable, the list of eligible specialisations for a Masters degree is included in the course’s 'specialisation schedule' in theCourse Handbook.\n\nCan Open Universities Australia (OUA) students change major?\nFor all change of major and minor requests relating to Open Universities Australia courses, please contactOpen Universities Australia.\n\nI’m not sure which major/specialisation I need to transfer to or what career it will lead to.\nYou can find information about the career prospects of different majors/specialisations on the Macquarie UniversityFind a coursewebpage.\nPlease also check your course overview (and major overviews) in theCourse Handbook.\nFor career resources, you can also contact theCareers and Student Employmentteam.\nTheCourse Guidance formhas more helpful information about how changing your major/specialisation can affect your studies.\n\nRelated articles\nCourse Guidance for continuing students\nHow do I change of major, minor or specialisation?"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Course-Transfer-FAQ",
    "text": "Course Changes\n28 Nov 2024\nKnowledge"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Course-Changes-careers",
    "text": "Course Changes\n20 Nov 2024\nKnowledge\nSearch theFind a Coursewebsite to review courses that may interest you and view potential professions for each course via the Career Outcomes tab.\n\nYou can also contact theCareers and Student Employment teamfor career resources.\n\nTheCourse Guidance Toolhas more information about how a Course Transfer may affect your course."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Course-Transfer-MQ-College",
    "text": "Course Changes\n25 Sept 2024\nKnowledge\nA course transfer can allow you to change from your current Macquarie University College course to a different Macquarie University College course.\n\nYou will need to submit anMQ College Program Transfer form.\n\nBefore you begin\nYou must first meet with an MQ College Student Advisor to determine your eligibility.\n\nFind out more on theMQ College - Course Transferwebpage."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Course-Transfer-how-to",
    "text": "Course Changes\n4 Oct 2024\nKnowledge\nBefore you begin\nCheck youreligibility\nCheck youreligibility\nCheck you meet thecourse requirements\nCheck you meet thecourse requirements\nComplete theCourse Transfer formvia theService Connect Portal\nComplete theCourse Transfer formvia theService Connect Portal\n\nRelated articles\nCourse Transfer FAQ\nCourse Transfer Eligibility\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/what-is-a-major",
    "text": "Course Basics & Terminology\n26 Dec 2024\nKnowledge\nA major consists of 80 credit points, of which 30 credit points must be at 3000 level. The list of eligible qualifying majors for a degree are included in the course’s 'major schedule' in theCourse Handbook.\nYou can check majors in theCourse Handbookby selecting Advanced Search > Course Component > Type > Major.\nRelated articles\nWhat is a minor?"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/what-is-a-minor",
    "text": "Course Basics & Terminology\n26 Dec 2024\nKnowledge\nA minor is a sequence of undergraduate units drawn from a major or specialisation but with a smaller volume of learning requirement. A minor consists of 40 credit points, of which 20 credit points must be completed at 2000 level or above.\nYou can check minors in theCourse Handbookby selecting Advanced Search > Course Component > Type > Minor.\nRelated articles\nWhat is a major?"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Important-Dates",
    "text": "Course Basics & Terminology\n11 Oct 2024\nKnowledge\nSome important dates to be aware of are the last day to enrol, the last day to withdraw, census date, payment due date, and the exams period."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/iLearn-Units",
    "text": "Course Basics & Terminology\n1 Oct 2024\nKnowledge\nIt can take up to 48 hours for a unit to appear iniLearnafter you enrol. If it has been longer than this then it may be that it is too soon for you to have access. Usethis toolto check when you should have access to a unit in iLearn.\nYou should also confirm you’re enrolled by going to the ‘My Study’ tile in eStudent and selecting the ‘Self Service Reports’ option from the left. You can request a copy of your “Enrolment Advice” which is a record of your enrolled units and class registrations.\nOnce you enrol, units can take up to 48 hours to appear in iLearn, so please allow this time if you have only recently enrolled.\nAfter 48 hours, if your unit is still not appearing in iLearn, and you’ve confirmed that it should be available by checking the tool above, then you should contactilearn.help@mq.edu.aufor assistance.\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Unit-Offerings",
    "text": "Course Basics & Terminology\n25 Sept 2024\nKnowledge\nUnit offering is the combination of study period, attendance mode and location.\nYou can check the unit offerings in theCourse Handbook. For more detailed information on a particular unit’s delivery, check the Unit Guide.\nAttendance modes (i.e., in-person or online), times (i.e., scheduled or flexible) and attendance patterns (i.e., weekday, intensive, in-person assessment) help you understand how you would study the unit.\nYou can check what attendance modes are available for your units by searching each unit in theCourse Handbook.\nPlease notethat available attendance modes are subject to change.\nYou can view ourEnrolment Support webpagefor a more detailed explanation on what unit offerings and attendance modes include\nQuick tip: UseClass Finderto see when and where your classes are being held and if they have space. Class Finder allows you to find specific units, when classes will be running, and how many spaces are left in each class.\nThe search results show information such as which building the class is taking place in, start and end time, as well as class type e.g. lecture, practical, tutorial etc.\n\nRelated articles\nUnit levels"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Unit-Levels",
    "text": "Course Basics & Terminology\n25 Sept 2024\nKnowledge\nMacquarie University has 3 year degrees for most undergraduate courses; so undergraduate units are classified as 1000 level, 2000 level or 3000 level. Undergraduate courses with 4 year degrees also have 4000 level units to complete.\nGenerally, our unit levels are:\nUndergraduate level = 1000 level (1st year)Undergraduate level = 2000 level (2nd year)Undergraduate level = 3000 level (3rd year)Postgraduate level = 8000 and 9000 level\nUnit levels should only be taken as a guide of where the unit sits in your degree. It is common to take some units outside of this order where appropriate.\n\nRelated articles\nUnit Offerings"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/First-Time-Login",
    "text": "Course Basics & Terminology\n25 Sept 2024\nKnowledge\nWhat is First Time Login and how do I access it?\nFirst Time Login is used to activate your OneID.\nTo log into the systems at Macquarie you will need to set up your OneID password.\nVisitFirst Time Loginto create and manage your password.\nFor assistance, contact ourIT Service Desk.\n\nRelated articles\nOneID"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Macquarie-Kickstart",
    "text": "Course Basics & Terminology\n19 Sept 2024\nKnowledge\nMacquarie Kickstart provides an orientation to Macquarie University, especially if you are transitioning from high school to university or are an international student.\nKickstart Week will introduce you to the values and expectations of Macquarie, with the aim of instilling a sense of community and providing you with an important foundation to succeed in your studies.\nTo register for Kickstart or to watch the sessions and to read more on Kickstart FAQs, read more atMacquarie Kickstart.\nOrientation Week is generally held during the week before classes commence and is a week of activities, tours and fun events that showcase our campus, help you find your way around and introduce you to some of our key student services.\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/PACE-Units",
    "text": "Course Basics & Terminology\n19 Sept 2024\nKnowledge\nAPACE (Professional and Community Engagement)unit engages you in real-world learning activities with organisations across Australia and around the globe.\nThrough PACE, you gain that all-important practical experience employers really value. All Macquarie bachelor degrees include at least one PACE unit, during which you’ll undertake a practical learning activity where you’ll explore key economic, social and ethical challenges by seeing first-hand how contemporary organisations address them. You get to contribute your knowledge, ideas and a fresh perspective to real-world projects which support the host organisation’s mission and objectives.\nYou can refer to theCourse Handbookto view your degree requirements."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Password-Reset",
    "text": "Course Basics & Terminology\n19 Sept 2024\nKnowledge\nIf you have forgotten or you wish to change your password, follow the instructions:\nGo topasswordchange.mq.edu.aufrom your PC or device\nLogin with your OneID number\nYou will be asked to enter the answers to questions that you set up when setting your OneID previously, then click 'Next'\nCreate a new password that meets the password criteria\nUpdate wi-fi, email and saved passwords on devices using your new OneID password\nMac users: Your Mac Keychain password will not change automatically. To update it to match your new OneID password, view use the Keychain Access utility located within Applications.\nIf you face any issues, please visit or contactIT Help Desk."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Recognition-of-Prior-Learning-how-to-apply",
    "text": "26 Dec 2024\nKnowledge\nBefore you begin\nReadRecognition of Prior Learning (RPL) FAQ\nCheck youreligibility\nCheck thedeadlineto apply (two (2) weeks before the study period start date)\nGather yoursupporting documents\nSubmit theRecognition of Prior Learning Formvia theService Connect Portal\nCheck theHow to Apply webpagefor more information on application deadlines and other useful tips:https://www.mq.edu.au/study/admissions-and-entry/rpl/how-to-apply\nRelated articles\nRecognition of Prior Learning FAQ\nRecognition of Prior Learning eligibility"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Recognition-of-Prior-Learning-FAQ",
    "text": "26 Dec 2024\nKnowledge\nThis article provides details about Recognition of Prior Learning and when to apply for it.\nWhat is Recognition of Prior Learning?\nRecognition of Prior Learning is for students wanting to have their prior study, work and other learning experiences recognised towards their Macquarie University course.\nMacquarie University recognises two main forms of prior learning for potential credit:\nFormal learningFormal learning is part of a structured program that leads to the full or partial achievement of an officially accredited qualification undertaken at a tertiary institution (eg university, TAFE or private college)\nFormal learningFormal learning is part of a structured program that leads to the full or partial achievement of an officially accredited qualification undertaken at a tertiary institution (eg university, TAFE or private college)\nInformal or non-formal leaningInformal learningis gained through work, social and family experiences. It is not organised or externally structured in terms of objectives, time or learning support.Non-formal learningtakes place through a structured program of learning but does not lead to an officially accredited qualification.\nInformal or non-formal leaningInformal learningis gained through work, social and family experiences. It is not organised or externally structured in terms of objectives, time or learning support.Non-formal learningtakes place through a structured program of learning but does not lead to an officially accredited qualification.\nPlease find answers to frequently asked questions about Recognition of Prior Learning (RPL) below.\n\nWhat type of credit can I receive?\nThere are two types of credit you can receive:\nSpecified credit - where your prior learning meets the learning outcomesfor a specific Macquarie University unit or units.\nSpecified credit - where your prior learning meets the learning outcomesfor a specific Macquarie University unit or units.\nUnspecified credit - credit that is granted towardsyour flexible zone at an appropriate level of learning.\nUnspecified credit - credit that is granted towardsyour flexible zone at an appropriate level of learning.\n\nIs it possible to receive Recognition of Prior Learning credits towards my postgraduate studies based on my completed undergraduate studies?\nUndergraduate studies can be assessed for Recognition of Prior Learning credit towards 6000-level units in postgraduate programs.\n\nWhat is the maximum amount of Recognition of Prior Learning that can be granted for particular Macquarie University qualifications?\nThe maximum amount of Recognition of Prior Learning that can be granted for particular qualifications is determined in accordance with theSchedule of Equivalenciesand theSchedule of Minimum Requirementsat Macquarie University.\n\nWhat documentation do I need to provide for a Recognition of Prior Learning application? / How can I get credit for Professional and Community Engagement (PACE) unit?\nDepending on the type of prior learning and type of credit you wish to receive, you may need to provide one or more of the following:\nan official academic transcript from your prior institution\nunit guides\nevidence of prior work experience\nIf you are applying forRecognition of Prior Learning for a PACEunit, you will need to provide the following:\nIf you would like to apply based on formal studies, you must provide:an official academic transcriptofficial and detailed unit outline of prior unitcompletedPACE Recognition of Prior Learning formfor each of theunits that you are seeking as specified creditYour current résuméLetter/s of reference written on official letterhead from current or past employers (including director supervisors), verifying your knowledge, skills, duration of service and experiencePosition description/s\nan official academic transcript\nofficial and detailed unit outline of prior unit\ncompletedPACE Recognition of Prior Learning formfor each of theunits that you are seeking as specified credit\nYour current résumé\nLetter/s of reference written on official letterhead from current or past employers (including director supervisors), verifying your knowledge, skills, duration of service and experience\nPosition description/s\n\nIf you would like to apply based on non-formal/informal experience such as work experience, you must provide:a current résuméletter/s of reference written on official letterhead from current or past employers (including direct supervisors) verifying your knowledge, skills, duration of service and experienceposition description/s, anda completedPACE Recognition of Prior Learning formfor each of the units that you are seeking as specified credit\na current résumé\nletter/s of reference written on official letterhead from current or past employers (including direct supervisors) verifying your knowledge, skills, duration of service and experience\nposition description/s, and\na completedPACE Recognition of Prior Learning formfor each of the units that you are seeking as specified credit\nYou can read more about the types ofdocumentationyou will need for your application.\n\nWhen is the deadline for submitting an application for Recognition of Prior Learning?\nThe deadline for submitting your application for Recognition of Prior Learning is two weeks before the session starts. This applies to all sessions.\nYou can still apply after this date; however, we cannot guarantee that you will receive an outcome by the time enrolment closes for that session.\nCheckHow to Applyfor more information on application deadlines and other useful tips.\n\nI've changed my mind, and I no longer want the RPL that I have received. How can I remove my credit?\nRequests to rescind credit must be academically justified and form part of an academic success intervention strategy.\nTo requesttorescind credit, please submit an enquiry via theService Connect Portalwith the subject line: Rescind Credit.\nImportant:requests must be received before the published RPL application deadlines as this will affect your enrolment for the upcoming Session.\n\nRelated articles\nRecognition of Prior Learning eligibility\nHow to apply for Recognition of Prior Learning"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Recognition-of-Prior-Learning-eligibility",
    "text": "14 Oct 2024\nKnowledge\nYou may be eligible for Recognition of Prior Learning if you:\nare a current student, or have an active offer\nhave had prior learning or work experience that may be relevant to your Macquarie University course\nYou can find more answers about eligibility for Recognition of Prior Learning below.\n\nI have worked in the field that is relevant to my course. Am I able to apply based on work experience?\nYes, you can apply for Recognition of Prior Learning based on your work experience.\nPlease seeRecognition of Prior Learning FAQon information about what supporting documentation you will need to apply.\n\nI received Recognition of Prior Learning upon admission, can I apply for further Recognition of Prior Learning?\nYou can apply for further Recognition of Prior Learning; however, it must be based on prior experiences not considered upon admission.\n\nCan I apply for Recognition of Prior Learning for my PACE unit?\nYou can apply for Recognition of Prior Learning for PACE units based on formal studies or informal experience.\nPlease seeRecognition of Prior Learning FAQon information about what supporting documentation you will need to apply.\n\nWhy was my Recognition of Prior Learning application rejected?\nIt is important that you carefully read the outcome of your application in theService Connect Portal. Your outcome will show in the “Related” tab of your RPL request.\nIf your application has been rejected, it could be due to several factors such as:\nfilling out the form incorrectly\nirrelevant prior learning experiences, or\nnot having enough space on your study plan\n\n\nRelated articles\nRecognition of Prior Learning FAQ\nHow to apply for Recognition of Prior Learning"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Previous-Macquarie-Univeristy-Student-PMQ",
    "text": "1 Oct 2024\nKnowledge\nIf you were a previous Macquarie University student and you would like to get credit for the units you have studied read the answers to frequently asked questions below.\n\nI was a previous Macquarie student and didn't complete my studies. How do I move my passed units to my new degree?\nTo move any eligible prior studies to your new course, you can apply forRecognition of Prior Learning.\nPlease readRecognition of Prior Learning FAQbefore applying.\n\nWill all of my previous Macquarie units be moved to my new degree?\nYour previous Macquarie units that contribute to the requirements of your current degree (as per theCourseHandbook) will be transferred over. Some units may not move to your new study plan for the following reasons:\nThey do not contribute to the course requirements; or\nThere is no Flexible Zone or free choice units in your new course; or\nThere is no space remaining in the Flexible Zone\n\nPlease refer to theRecognition of Prior Learning policy.\n\n\nRelated articles\nRecognition of Prior LearningFAQ\n\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Change-of-Major-how-to-change",
    "text": "Course Changes\n14 Oct 2024\nKnowledge\nTheChange of major, minor, or specialisation formallows you to request a change to one or more of the following:\nMajors (qualifying majors and/or flexible zone majors)\nMinors\nSpecialisations (undergraduate and postgraduate degrees)\nYour course requirements can be found in theCourse Handbook, which will provide you with details about your admitted course, including whether there are any major, minor, specialisation, and/or concentration requirements.\nWe strongly recommend that you seek Course Guidance to understand the impact of this change.\nInformation about course requirements and the Curriculum Architecture can be found in theCurriculum Architecture Policy.\n\nRelated articles\nCourse Guidance for continuing students\nChange of Major, Minor or specialisation FAQ\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Change-of-major-minor-specialisation",
    "text": "Course Changes\n27 Sept 2024\nKnowledge\nAs you progress through your degree, you may find your interests change along the way.\nSubmit achange of major, minor, or specialisationform to request a change to one or more of the following:\nMajors (qualifying majors and/or further majors)\nSpecialisations (undergraduate and postgraduate degrees)\nMinors\nStreams (Macquarie University College Intensive and Standard Foundation Programs)\nQuick Tip:You can change your major or specialisation via the Manage my Course tile in eStudent if you:\nare in your first study period at Macquarie University\nhave not yet enrolled, and\nhave no Recognition of Prior Learning.\n\nRelated article\nChange of major, minor or specialisation FAQ\nHow do I change of major, minor or specialisation?"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Academic-Standing",
    "text": "Course Progression\n26 Dec 2024\nKnowledge\nYour Academic Standing indicates your current progress towards completing your Course.\nIt is calculated after session results release. Session 3 units are not included in your Academic Standing calculation.\nYour academic standing is based on:\nthe proportion of credit points that you passed in the current study period, together with\nyour academic standing at the end of the previous study period.\nYou can view your academic standing on your unofficial academic transcript at any time.Go to eStudent>My Study>Self Service Reports>unofficial transcript.\nYou can also see your academic standing on your Result Notification, which will be emailed to you after results release.\nIt is important for you to understand what your current academic standing is as it may affect future enrolment.\n\nFurther information\nPlease see theAcademic Standing FAQs.\nIf you are on a status of Academic Pause or Exclusion, you will receive an Academic Standing Notification letter to your student email address.\nTo find out more, check outAcademic StandingandAcademic Progression."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Withdrawal-without-penalty-FAQ",
    "text": "Course Progression\n14 Oct 2024\nKnowledge"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Readmission",
    "text": "Course Progression\n1 Oct 2024\nKnowledge\nFollowing a period of Exclusion, you must apply to return to your studies through the prescribed method, which will vary depending on your chosen course.\nUpon returning, it is highly recommended you submit a structured enquiry via theService Connect Portalwith the subject line \"Returning after Exclusion\" so that you can be assisted with forming a plan to help you readjust to study.\n\nRelated article\nAcademic Standing"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Study-Overseas",
    "text": "26 Dec 2024\nKnowledge\nYou can study overseas during your course at Macquarie University by taking part in a semester or short-term international mobility program.\n\nBy going on one of these programs, you will:\nbecome more confident and independent\ntake advantage of unique courses offered abroad, like Fine Arts in Italy or Marine Biology in Fiji\nincrease the value of your degree\nbuild personal and professional global networks\nenhance your professional profile - employers will look favourably on your overseas experience as evidence of your ability to take initiative and work independently\nexperience new cultures and life in other countries\nhave adventures, make friends, and travel whilst adding value to your degree\n\nVisit ourStudy Overseas portalto find more about our different programs and destinations."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Incoming-Exchange-Students",
    "text": "5 Dec 2024\nKnowledge\nIf you are an incoming exchange or study abroad student, please visitOverseas Student Health Cover (OSHC).\n\nAs an international student, you must have a valid OSHC as a condition of your student visa. Please visitOverseas Student Health Coverfor further information.\n\nThe Australian Federal Government Health Department has created aFact SheetandExplanatory Guidelines for Consumerswith useful information on the OSHC mandatory requirement for international students.\n\nYou may choose to go with Macquarie University’s OSHC provider,Medibank. Information on how to pay for your OSHC will be provided along with a Letter of Offer. Once you accept your offer to come to Macquarie University on an Exchange or Study Abroad program, you will receive a Confirmation of Enrolment (CoE). Your OSHC information is provided in your CoE. Your OSHC policy number is the same as your Macquarie University student ID.\n\nFor any concerns regarding how OSHC works, please contact theDepartment of Home Affairs (DHA).\n\nQuick Tip:You can accessIncoming Exchange and Study Abroad Student FAQswhereyou will find answers to the most frequently asked questions before, during, and after coming to Macquarie University on one of these programs.\n\nRelated Article\nConfirmation of Enrolment (CoE) FAQ\nStudent Visa Conditions\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Graduation-Defer-Ceremony",
    "text": "Graduation\n26 Dec 2024\nKnowledge\nIf there is no reasonable way for you to attend your allocated Graduation Ceremony, we would like to give you the opportunity to apply to defer your ceremony to a future date.\nRequests will be assessed based on compelling personal, medical, cultural, professional or academic reasons.\nSupporting documentation must be provided, and should:\nIdentify your full name\nExplain how there is no reasonable way for you to attend your allocated ceremony\nInclude the dates for the duration of time you will be affected\nPermission to defer your ceremony can only be requested after you receive your graduation invitation and must be lodged through theGraduation Ceremony Deferral ­form.\nImportant: Your Graduation Invitation email will include the deadline for applying for deferral.\n\nYou will find answers to frequently asked questions about deferring your graduation ceremony.\n\nHow do I know if I have a valid reason to defer my graduation?\nYou may apply to defer your graduation for up to 12 months if you have one of the following reasons: personal, medical, professional, academic or cultural reasons.\nYou will need to apply in order for the Graduation team to assess your circumstances.\nSupporting documentation must be provided, which should be official and:\nIdentify your full name\nExplain how there is no reasonable way for you to attend your allocated ceremony\nInclude the dates for the duration of time you will be affected\n\nWhat are some of the acceptable personal reasons for deferring my graduation ceremony and what are the evidence required to be considered?\nSome examples for personal circumstances which may be considered are:\nOut of Sydney at the time of your graduation ceremony. This could be accompanied with an official travel itinerary/departing AND returning flights.\nUnexpected family commitments (such as caring duties for a family member or partner). Evidence of the circumstances (if they are not sensitive in nature) could be provided otherwise, a statutory declaration.\nInternational travel restrictions for yourself. Evidence could include advice from local government authoritywhich states current travel restrictions, or evidence of application processing times and submission dates.\n\nWhat are some of the acceptable medical reasons for deferring my graduation ceremony and what is the evidence required to be considered?\nSome examples for medical reasons to apply which may be considered are:\nPlanned surgeries, unmovable medical appointments or other medical reasons. Evidence may include a confirmation letter of surgery or appointment, or a doctor’s letter advising you are not to attend or similar.\nPlease do not submit sensitive information or images depicting your medical issue or injury. We are unable to interpret medical information for you.\n\nWhat are some of the acceptable professional reasons for deferring my graduation ceremony and what is the evidence required to be considered?\nProfessional grounds to apply may include work commitments that cannot be scheduled. Acceptable evidence on professional grounds could include: a letter from your employer, flight itinerary or travel notice, or statutory declaration.\n\nWhat are some of the acceptable academic reasons for deferring my graduation ceremony and what is the evidence required to be considered?\nAcademic grounds to apply may include:\nAn unavoidable exam, study or teaching commitments that cannot be rescheduled. Evidence may include a Unit or Study Guide, Exam timetable, email advice from your educational institution or a statutory declaration.\n\nWhat are some of the acceptable cultural reasons for deferring my graduation ceremony and what is the evidence required to be considered?\nCultural grounds to apply may include:\nSignificant religious or cultural events or holidays. You will need a personal statement of the cultural reason*.\nWhere specific evidence cannot be provided, a Statutory Declaration must be submitted and signed by an authorised witness.\n\nWhat if I simply forgot to respond to the invitation to my graduation ceremony?\nGraduates who do not attend their allocated graduation OR have not responded to the invitation are considered to have declined to attend and will not be invited to any subsequent ceremony.\nYour documents will be held by the Graduations Team until you nominate how you would like to receive your graduation documents by completing theGraduation in Absentia formon theService Connect Portal.\n\nRelated Articles\nGraduation in Absentia\nGraduation in Absentia: how to obtain documents"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Graduation-on-the-day-of-ceremony-FAQs",
    "text": "Graduation\n26 Dec 2024\nKnowledge\nRead the information below for everything you need to knowongraduation day.\nOr go to our other helpful articles for everything you need to knowbeforegraduation day andaftergraduation day.\nWhat time do I need to be in the hall for my graduation?\nGraduates are strongly advised to be seated 30 minutes before the ceremony start time to ensure you don’t miss the final ceremony instructions.\nThis means you should arrive to Registration 90 minutes before the ceremony start time so that your attendance can be confirmed, and you can be gowned.\n\nHow do I register on the day of graduation ceremony?\nThe registration room at the Mezzanine Floor on 1 Central Courtyard (1CC_ opens 90 minutes before your ceremony. You will be directed to use the QR codes provided to register your attendance and proceed to academic dress fitting.\nYour guests may proceed to the Lower Ground Floor on 1 Central Courtyard where guest entry is located.\n\nWhat should I expect on the day of my graduation?\nGraduates who have RSVPed as attending will be sent an Attendance Confirmation email, which includes useful information about what to expect on their ceremony day. This is sent approximately a week before the ceremony series commences.\nOn the day of the graduation ceremony, order of proceedings are as follows:\nYour graduation ceremony will commence with the entry of the academic procession into the Graduation Hall lead by the Registrar carrying the Ceremonial Staff. The Presiding Officer of your ceremony is the last member of the procession to enter the Graduation Hall. The Presiding Officer is preceded by the Mace Bearer who carries the University Mace – which is the symbol of his or her authority.\nWhen the members of the academic procession have taken their place on the dais, the musical group will play Advance Australia Fair. Trenchers are removed for the National Anthem. At the conclusion of the National Anthem, the audience resume their seats, and the ceremony will be formally opened with a brief welcome.\nThe Presiding Officer will open the proceedings.\nThe Registrar will ask all graduands to stand and testify that the Academic Senate of the University has certified that you have completed the requirements for the award of your degree or your diploma. The presiding Officer will then, by the authority conferred on them by the Council of the University, admit you to the degree or diploma for which you have qualified. At this point, you become a graduate.\nEach row of graduates is guided by the graduation staff around to the northern end of the dais, where your graduation document will be given to you in a presentation folder, which will be part of your presentation photograph with the Presiding Officer.\nEach graduate is presented individually to the Presiding Officer, in the order set out in the printed graduation program, by the Executive Dean of their Faculty (or their nominee). The Presiding Officer will pose for a photograph with each graduate at this point.\nAfter the photograph, do not go down the steps at the centre of the stage, proceed across the dais and exit via the ramp at the back of the dais before returning to the graduation seating area.\nAt the end of the presentation of the graduates, there is a graduate address followed by brief musical interlude.\nThe Presiding Officer will speak briefly before closing the proceedings.\nThe presiding Officer will lead the academic procession from the dais. The Registrar will be the last member of the academic procession to leave the dais, which will then be followed by graduates joining the academic procession.\n\nWhat attire do I wear for my graduation?\nYour Graduation Fee will include academic dress hire/purchase, and all graduands are required to be in full academic dress to take part in the graduation proceedings. As academic gowns are open at the front, clothing worn underneath will be clearly visible. Suggested attire includes business or semi-formal attire and comfortable shoes.\n\nWhat do I do if I arrive late for my graduation?\nGraduates who arrive after the ceremony has commenced may not be permitted to enter the Graduation Hall and will forfeit their ceremony.\n\nHow long is the graduation ceremony?\nCeremonies run for approximately 90 minutes.\n\nCan my family and friends view my graduation if they are not present?\nYes! Your family and friends can view live stream of the ceremony or watch previous ceremonies by visitingGraduation live stream.\n\nCan you accommodate accessibility requests?\nOf course! We endeavour to ensure that your graduation day is smooth and stress-free for you and your guests. You can let the Graduation Team know how they may assist you with your accessibility concerns when you RSVP on the Graduation Portal (linked in your Graduation Invitation).\nPlease note the graduation hall currently has the following features:\nFully wheelchair accessible\nShuttle bus service that runs from West 5 Car Park to the Graduation Hall\nAdditional golf buggy service available for additional transport support\nRamps and railings available for graduates to access the stage (no stairs required)\nYou may also contact the Graduations Team via an enquiry to theService Connect Portalto discuss any additional requirements that you or your guest may have.\n\nWhere do I park if I am coming for my graduation?\nThe best place to park is Car Park West 5 (behind the Gymnasium) as a graduation shuttle bus service will operate every 15 minutes during graduation to escort guests to and from the Graduation Hall.\n\nWhat can I bring to my graduation?\nYour mobile phone and bottled water are permitted in the Graduation Hall.\nYou will need your phone to check in into the Graduation Hall. We strongly advise you to consider your attire as the graduation gown will not have any pockets. If you are not wearing clothing with pockets, you may conceal your phone behind your graduation documents, so it is not visible when you cross the stage.\nPrams/strollers, flowers, tripods and other items which may obstruct passageway or viewing/comfort of other guests are not permitted in the hall. These items may be stored in the Cloak Room right outside! Handbags and backpacks must not exceed 400mm x 320mm x 100mm.\nImportant: We do not accept responsibility for items left in the Cloak Room.\n\nRelated articles\nBefore Graduation Ceremony FAQ\nAfter Graduation Ceremony FAQ\nHow to access graduation documents"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Alumni-access-to-the-library-and-online-databases",
    "text": "Graduation\n26 Dec 2024\nKnowledge\nAlumni are entitled to free lifetime membership of Macquarie University Library, including borrowing privileges and special access to limited online databases and ebooks.\nThis is part of our extensiveAlumni Benefitsprogram.\nThere is no registration fee.\nComplete the registration form on ourlibrary access webpage. This will give you both borrowing privileges and database access.\nYou will receive an automatic email with further instruction to create your login and password.For category, selectMacquarie University Alumni/Partners/Communityand for Library Membership, selectAlumni (Macquarie University). You do not need to upload any ID as there will be an alumni verification check.\nCreate your OneID login and password. Follow instructions from the email. This will be your alumni OneID and password.\nLogin to online databases using new OneID and password. You can find all the databases available on the Alumni library services webpage.\nWhen you click on each database, it will ask you to login.\nPlease note:\nAccess may be limited due to publisher agreements.\nThese databases may be used off-campus by Macquarie alumni for personal, non-commercial use.\nUse of these resources for commercial gain is not permitted.\nIf you are able to come into the Library, you have full access to all the databases using the Library computers\nFind answers to otherfrequently asked alumni questions."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Graduation-Replacement-Testamur",
    "text": "Graduation\n4 Dec 2024\nKnowledge"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Conferral-of-degree-FAQ",
    "text": "Graduation\n14 Oct 2024\nKnowledge\nConferral of a degree refers to the formal transition from a graduand (someone who is about to be graduate) into a graduate, when you have been officially awarded your degree.\nFor your degree to be conferred, you must have completed all academic and practical requirements and have no outstanding sanctions to the University.\nWhen will my degree be conferred on me?\nYour conferral month is mentioned in your Completion Letter, which you will receive within 3 business days of your qualification date. You will then be sent a Conferring of Degrees email within a week of your Completion Letter.\nPlease note:This is NOT your graduation ceremony invitation. Conferral dates are based on University Council meeting dates. Eligible graduands are notified approximately 4 weeks prior to the relevant Council meeting date.\n\nRelated article\nCompletion letter"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Qualification-Check-USI",
    "text": "Academic Sanctions\n1 Oct 2024\nKnowledge\nThe USI is a lifelong reference number issued by the Australian Government for your education journey. It is made up of a combination of ten numbers and letters.\nFrom 1 January 2023, all higher education students (including those who commenced prior to 2021 and international students studying onshore) must have a USI to graduate and receive their award. Find out more about how to apply and provide yourUSI.\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Graduation-Memorabilia",
    "text": "Graduation\n1 Oct 2024\nKnowledge\nIf you have an issue with your memorabilia or would like to follow up on orders or to place an order outside of the graduation period, please contact the vendors directly.\n\nMacShop\nOrder Macquarie branded merchandise, such as graduation bears and ties.\nE:merchandise@mq.edu.au\nW:shop.mq.edu.au\n\nAmbassador productions\nPlaques\nGraduation video on DVDs and USBs\nT: +61 (2) 9962 8251\nE:enquiries@ambassador.com.au\nW:ambassador.com.au/product-category/macquarie-university/\n\nGraduation photography\nDegree framing\nStudio portrait photography sessions\nPresentation photo packages\nT: +61 (2) 9804 7777\nE:orders@graduationphotography.com.au\nW:graduationphotography.com.au/MQ"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Graduation-How-to-access-documents",
    "text": "Graduation\n1 Oct 2024\nKnowledge\nYou will receive an email notification once your graduation documents are available to be viewed on theMy eQualsplatform. Please note that digital graduation documents (Testamur, Academic Transcript, AHEGS) are released via My eQuals can take up to 2 weeks from your conferral date to be available."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Course-Exceptions-Leave-of-Absence",
    "text": "Making Changes To My Study Load\n4 Dec 2024\nKnowledge\nYou can only apply for leave of absence for 12 months (that is, two consecutive study periods) if you are enrolled in one of these courses:\n\nDoctor of Medicine\nDoctor of Physiotherapy\nMaster of Speech and Language Pathology\nMaster of Clinical Audiology"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Individual-Educational-Access-Plan-Course-IEAP",
    "text": "Course Progression\n19 Sept 2024\nKnowledge\nMacquarie is committed to providing a learning environment that complements and enhances the University experience for all students.\nStudents with a disability or chronic health condition may have reasonable adjustments made to enable them to meet inherent requirements.\nInformation on your Individual Education Access Plan (IEAP) may be distributed to Macquarie staff to assist in the implementation of reasonable adjustments.\nOnce you have met with an Accessibility Advisor, you will be given an IEAP. Your IEAP is based on your specific circumstances and health situation as well as your program of study.\nIf you need to change your IEAP or wish to meet with an Accessibility Advisor to discuss your IEAP or support, please submit a request via theonline portal."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Appeals",
    "text": "Academic Appeals\n25 Sept 2024\nKnowledge\nThe University makes a range of decisions affecting students, from course admissions and Recognition of Prior learning, to marks you receive for a particular unit, as well as a range of other decisions.\nThe University aims to make fair and equitable decisions and has established policies and procedures to ensure this happens.\nIf you have been notified of a decision made by the University and you are not satisfied with the decision-making process, you may be able to lodge an appeal.\nYou will need to submit anAcademic Appeals form.\nNot all decisions can be appealed. Please see theAppealsfor full details.\nQuick tip:Appeals will be managed through the Academic Appeals Committee and are to be made in accordance with the Academic Appeals Policy."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-Unable-to-plan-Free-Choice-units",
    "text": "Class Registration & Timetables\n1 Oct 2024\nKnowledge\nIf you are studying a 2020 double degree and are unable to plan units in your Free Choice option set, you will need to submit theEnrolment Support formwith screenshots. Please make sure to note down what unit/s you are trying to enrol into."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Status-Letter-how-to",
    "text": "1 Oct 2024\nKnowledge\nA status letter confirms your current enrolment status and can be used for identification purposes.\nTo request a Status Letter, please follow the steps below:\nLogin to eStudent\nClick on 'Forms' tile\nSelect 'Status Letter Request'\nClick on 'Fill Out' button\nSelect your admitted course\nPress 'Submit'\nYour Status Letter will be sent to your student email account.\nPlease allow an hour for this process.\n\nRelated article\nStatus Letter: Domestic\nStatus Letter: International"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Residency-Verification-Australian-citizen",
    "text": "3 Oct 2024\nKnowledge\nTo change or verify your residency, you must inform us by submitting theResidency Verification formwith appropriate documentation prior to the nextcensus dateof your study period.\nThis article has answers to questions about Residency Verification for Australian citizens.\n\nHow do I update my residency status to Australian citizen?\nBefore you can apply to have your citizenship updated, you must ensure that either your Australian Citizenship certificate or Australian Passport has been certified and upload via theResidency Verification form.\nPlease seeCertifying Documentsfor information about who can certify your documents.\n\nI have submitted my certified document, what happens next?\nIf your application is successful, you will be advised to submit a neweCAFfor HECS-HELP or FEE-HELP with your Tax File Number (TFN), if you haven’t already done so.\n\nI have already paid my fees upfront, can I apply for a refund?\nIf you have paid upfront and have been assessed as eligible to defer your fees via HELP loan, you must notify the Student Revenue Services via theService Connect Portalbefore the census date to request a refund.\nImportant:once the census date has passed, you cannot change your mind and request a refund.\n\n\nRelated Articles\nResidency Verification – FAQ\nResidency Verification – Permanent Residents (Non-humanitarian) or New Zealand Citizens\nResidency Verification –PermanentResident Humanitarian\nResidency Verification –Former Permanent Resident (Humanitarian) Visa holder\nHow to update my residency status?"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Unit-reinstatement-after-initial-withdrawal",
    "text": "1 Oct 2024\nKnowledge\nUnit reinstatement requests must be submitted within 48 hours of unit withdrawal.\nIt can only be considered and assessed up to thecensus dateof the study period."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Late-Unit-Enrolment-how-to",
    "text": "14 Oct 2024\nKnowledge\nBefore you begin\nCheck your eligibility viaLate Unit Enrolment FAQ.\nYou can apply for Late Unit Enrolment by following the steps below:\nPlan the units you intend to study in the respective study period ineStudent.\nPlan the units you intend to study in the respective study period ineStudent.\nPrepare any supporting documents, which may include:\nPrepare any supporting documents, which may include:\nAny communication/advise received from the universityEvidence of delayed outcome of appeal/advise that prevented you from enrollingMedical certificate/letter explaining the medical circumstances/ traumatic experience preventing the student from enrolling on timeDeath certificate and proof of relationship with the deceased (birth certificate/passport/family card)Travel documentation (visa copy and itinerary)\nAny communication/advise received from the university\nEvidence of delayed outcome of appeal/advise that prevented you from enrolling\nMedical certificate/letter explaining the medical circumstances/ traumatic experience preventing the student from enrolling on time\nDeath certificate and proof of relationship with the deceased (birth certificate/passport/family card)\nTravel documentation (visa copy and itinerary)\nSubmit the LateUnit Enrolment Formvia theService Connect Portalalong with supporting documents\nSubmit the LateUnit Enrolment Formvia theService Connect Portalalong with supporting documents\n\nRelated articles\nLate Unit Enrolment FAQ"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Course-Changes-with-Scholarship",
    "text": "25 Sept 2024\nKnowledge\nDepending on your awarded scholarship, change to your enrolment may impact your continuing eligibility for scholarship.\nSo, if you are considering making changes to your enrolment (eg. transferring to another course, reducing your study load, suspend your studies, etc), please notify theScholarships Teamatscholarships@mq.edu.auprior to making the change.\n\nRelated article\nStudent Visa Conditions"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Course-Transfer-Application-Dates",
    "text": "Knowledge\nThe application opening and closing times are in the table below.\nImportant:Late applications will not be accepted.\n\n\nOpening\nClosing\nSession 1 2025\n14 October 2024\n14 February 2025\nSession 2 2025\n19 May 2025\n18 July 2025"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Sanctions-financial",
    "text": ""
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-class-registration",
    "text": "Class Registration & Timetables\n21 Jan 2025\nKnowledge\nWhen class registration opens, register in classes via the My Class Registrations tile on eStudent.\nYou must be enrolled in the unit before you will be able to register in classes. Follow our detailedeStudent tutorialto see how to register for your classes.\nFor some units, you will need to select from a “stream”. This means that you will be registering in multiple times for that class.\nQuick tips:\nCheckEnrolment Datesto see when class registration will open for you\nUseClass Finderin eStudent to see when and where your classes are being held and if they have space.\nClass Finder:\nClass Finder allows you to find specific units**, when classes will be running, and how many spaces are left in each class.\nThe search results also show information, such as, which building the class is taking place in, start and end time, as well as class type e.g. lecture, practical, tutorial etc.\nTo access Class Finder, click on the icon on the homepage of eStudent.\n** the tool is only available for units that require you to register for a unit in eStudent.\nClass Registration Issues\nIf you are having issues with your class registration, please click the relevant link below for more information.\nAll of myclasses are full\nI have aclass clash\nA unit I have enrolled into isn’t coming up on‘My Class Registrations’\nFor any other issues, please review the information on theEnrolment Support formfor further assistance."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/CPA-CA-Enrolment-MMBA8155",
    "text": "Class Registration & Timetables\n14 Oct 2024\nKnowledge\nIf you are admitted to the Master of Business Administration, you can take MMBA8155 Management Internship.\nYou will need permission to enrol into the unit, which you can request via theSpecial Approval form.\nFor further assistance contact MQBS Educational Service team:\nPhone:+61 (2) 9850 7829\nEmail:mqbs-studentservices@mq.edu.au"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-unit-quota",
    "text": "Class Registration & Timetables\n4 Oct 2024\nKnowledge\nSome unit offerings may be subject to a quota. This means that there is a maximum number of students that can enrol into that unit offering. If a unit offering is subject to a quota, it will be indicated in the unit’s Handbook page under “Offerings”.\nOnce the quota has been reached, you will not be able to enrol into that unit offering. If this is the case, the offering will not show up as an option oneStudentand you may have to choose a different unit or offering.\nPlease note:the Class Finder tool is not indicative of the enrolment numbers for a unit. If a unit or offering with a quota is not available to enrol into on theeStudent‘Plan and Enrol’ page, this generally means that the quota has been met, even if you can see classes available on Class Finder."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-student-who-wish-to-reattempt-error",
    "text": "Class Registration & Timetables\n4 Oct 2024\nKnowledge\nThis error may arise on the eStudent “Plan and Enrol” page when you are trying to enrol into a previously failed unit. If you receive this error in this case, please submit theEnrolment Support formfor further assistance, including screenshots and noting the unit you are trying to enrol into.\nThis error may also arise on the “Manage My Course” page when you are trying to add a unit to your study plan that has already been added elsewhere. Please check the other parts of your study plan to see if the unit is already planned.\nIf the unit is already planned elsewhere, you may need to select a different unit. A unit may only count towards the requirements for one component of your course (e.g., an essential unit cannot also count towards the requirements of an elective set).\nIf you are not trying to add a unit that is already on your study plan, please submit theEnrolment Support formwith screenshots for further assistance. Please ensure you are specifying which unit you are trying to add to your plan."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-prerequisite",
    "text": "Class Registration & Timetables\n4 Oct 2024\nKnowledge\nFor some units, enrolment is dependent upon meeting certain requirements. These requirements are listed in the relevant unitCourse Handbookpage. Some types of requisites you may encounter are:\nPrerequisite: a unit, requirement, or condition you need to have completed before enrolling into a specific unit\nCo-requisite: unit you must complete prior to or concurrently with another unit\nNCCW* (Not to Count for Credit With): A unit labelled NCCW may not count for credit with another specified unit.\nYou will only be able to enrol into a unit if you have met any listed requisites.\nIf you believe you have obtained the prerequisite knowledge for a unit through other means, you can apply for aPrerequisite Waiverto be considered for enrolment in the unit.\nIf eStudent advises that you do not meet the requisites, but you have checked the Handbook and believe you do meet the requisites, please visitEnrolment Prerequisite.\n*If you have a core unit you are unable to complete due to having completed an NCCW unit, please submit theCourse Guidance formfor assistance."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-Error-Prerequisite-Issue",
    "text": "Class Registration & Timetables\n4 Oct 2024\nKnowledge\neStudent is an enrolment tool and therefore at times it may not display pre-requisites correctly. Please refer to theCourse Handbookwhen checking pre-requisites for units. If, after checking the Handbook, you believe you have met the pre-requisites but eStudent advises that you do not, you should:\nUnschedule the unit in the “Plan and Enrol” screenRe-schedule the unit and select the study combination (this should remove the error)Click “Enrol”Click “Confirm”\nUnschedule the unit in the “Plan and Enrol” screen\nRe-schedule the unit and select the study combination (this should remove the error)\nClick “Enrol”\nClick “Confirm”\nIf you are still unable to enrol after following these steps, please submit aPrerequisite Waiverapplication to be considered for enrolment. In your application, make sure you specify that you do meet the prerequisites, however eStudent advises that you do not.\nImportant:you will not be able to enrol into a unit if you do not meet the prerequisites. More information can be found in thePrerequisite article.\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-steps",
    "text": "Class Registration & Timetables\n4 Oct 2024\nKnowledge\nIf you don’t know how to enrol, please visitHow to Enrolfor further guidance. This webpage had detailed eStudent tutorial videos to guide you through the enrolment process, as well as tips for enrolment.\nIf you are a new student and are unsure which units to enrol in, please go to our New Students (KBA) article for some guidance on how to select units for your first semester.\n\nRelated articles\nNew Student Enrolment"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-Session-3",
    "text": "Class Registration & Timetables\n1 Oct 2024\nKnowledge\nSession 3 is a study period taught in a \"condensed mode\" from late November or early December to the end of January the following year. Session 3 units have the same amount of content as Session 1 or 2 units, but rather than lasting 13 weeks like Sessions 1 and 2, Session 3 is roughly half that length, so you have more classes/content to complete each week per unit than in a normal session. Because of this \"condensed mode\", you can only study one or two units in Session 3. Studying two Session 3 units is an equivalent workload to studying four units in a normal session.\nStudying in Session 3 is not mandatory, but it can be a great opportunity to catch up or get ahead in your studies.\nNot every unit is taught in Session 3, but you can search theCourse Handbookto find units available in Session 3 by choosing the 'Advanced Search' option under the search bar on the Course Handbook homepage, then searching 'Units' and filtering 'Study Period' to 'Session 3'. This shows all units taught in Session 3 in the selected year. You can also add other filters, so you can find Session 3 units taught by different departments or faculties, or units at different 'levels.'\nPlease ensure you finalise your enrolment by thelast date to enrolfor the study period. If you need assistance enrolling, please viewEnrolling.\n\nRelated articles\nEnrolment: how to enrol\nUnit offerings"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Credit-Overload-eligibility",
    "text": "Making Changes To My Study Load\n14 May 2025\nKnowledge\nWho can apply for credit overload?\nCredit overload is available to both domestic and international students.\n\nWho cannot apply for credit overload?\nMacquarie College students, PhD and research students and non-award students are not eligible for credit overload.\n\nOther requirements\nYou can apply for credit overload for any unit that you are able to plan in eStudent. If you cannot plan for a unit in your course, you cannot enrol in it.\nYou must meet the prerequisites for any units you plan to study or have an approvedSpecial Approval Waiver.\nYour weighted average mark (WAM) must be over 50.00 and your academic standing must be satisfactory at the time you apply.\nImportant:You must resolve any outstanding debt or financial sanction before you apply.\nTo ensure your credit overload request is considered for the current or upcoming study period, it must be submitted by the following closing dates:\nRequests submitted after the relevant close dates will not be processed.\n\n\nRelated articles\nCredit Overload FAQ\nHow to apply for credit overload"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Credit-Overload-how-to",
    "text": "Making Changes To My Study Load\n14 Oct 2024\nKnowledge\nCredit overload is not automatic. You must apply for approval of a credit overload first.\nBefore you begin\nRead theeligibility\nCheck thedeadline\nCompletetheCredit Overload formvia theService Connect Portal.\n\nRelated articles\nCredit Overload FAQ\nCredit Overload Eligibility\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Full-time-study-load-for-domestic-students",
    "text": "Making Changes To My Study Load\n1 Oct 2024\nKnowledge\nFor Macquarie Universitysession-based students, a full-time load is 30 - 40 credit points (3 - 4 units) in each study period (Session 1 and Session 2).\nFor Macquarie Universityterm-based students, a full-time load is 20 credit points (2 units) each term."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Full-study-load-for-international-students",
    "text": "Making Changes To My Study Load\n1 Oct 2024\nKnowledge\nFor Macquarie Universitysession-based students, a full-time load is 40 credit points (4 units) in each compulsory study period (Session 1 and Session 2).\nFor Macquarie Universityterm-based students, a full-time load is 20 credit points (2 units) in each term.\n\nRelated articles\nReduce study load\nFull time study load for domestic students"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Sanctions-general",
    "text": "Academic Sanctions\n27 Mar 2025\nKnowledge\nIf you can’t enrol into any units, it may be because you have a sanction blocking your account. You can check whether you have a sanction by going to eStudent > My Details and clicking ‘Sanctions’ on the left-hand side.\nBelow are some common sanctions. Please click the relevant sanction to find out more about how to lift them:\nFinancial sanction, including Student Services and Amenities fee (SSAF)\nUnique Student Identifier (USI) sanctions\nAcademic sanctions (related to Academic Standing)"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-troubleshooting-classes-full",
    "text": "14 May 2025\nKnowledge\nIf you are unable to register in classes for the unit(s) because all classes are full, please checkeStudentregularly so you know when more space is available.During the enrolment period, more classes can be added gradually as enrolment numbers for the unit become clearer.Space in existing classes can also become available as other students alter their unit enrolment and class registration.Please note that new classes will generally only be added if all the existing classes are full.\nDuring the enrolment period, more classes can be added gradually as enrolment numbers for the unit become clearer.\nSpace in existing classes can also become available as other students alter their unit enrolment and class registration.\nPlease note that new classes will generally only be added if all the existing classes are full.\nIf your preferred class is full, but there are other classes with space available, please register in another available class.\nKeep in mind that many lectures are recorded and do not require attendance.If your lecture time is full, this may not be an issue as you can watch the lecture online after the scheduled time.However, it’s a good idea to check theUnit Guideor information available oniLearnto make sure attendance is not required for your unit.If the unit guide or iLearn page is not available yet, it will be made available closer to the start of session.\nIf your lecture time is full, this may not be an issue as you can watch the lecture online after the scheduled time.\nHowever, it’s a good idea to check theUnit Guideor information available oniLearnto make sure attendance is not required for your unit.\nIf the unit guide or iLearn page is not available yet, it will be made available closer to the start of session.\nRelated article\nUnit offerings"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-unit-offerings",
    "text": "31 Mar 2025\nKnowledge\nNot all units are offered in every session. You can check when units are offered in the unit’sHandbookunder ‘Offerings.’\nPlease note that you can only enrol into a unit in a study period it is offered. You should consider this when planning your enrolment.\nPlease note: if you are trying to “Plan a Study Period” on eStudent and the unit is covered with a “Lock”, this means the unit is not offered in the study period you are trying to plan. Please review the Handbook for available offerings of the unit.\nNote that some unit offerings are subject to a quota. Please seeUnit quotafor more information.\nIf you are unable to plan a unit in a study period that is it offered in (according to the Handbook), please visit theOffering errorfor further information."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-Offerings-Error-No-study-periods-available",
    "text": "31 Mar 2025\nKnowledge\nYou can only enrol into units during study periods that they are offered. You should refer to the unit’sHandbookpage under “Offerings” to check when a unit is offered.\nIf the Handbook advises that a unit is offered in a study period, however eStudent advises that there is ‘No study periods available’ when you try to enrol, or otherwise will not let you schedule the unit for that study period, please try the following troubleshooting steps:\nRemove the unit from your study plan in eStudent > ‘My Study’ > ‘Manage My Course’ by clicking on the drop-down icon to the right of the unit and clicking ‘Remove’.\nAdd the unit back to your study plan by clicking ‘Select’ next to the relevant option set and clicking ‘Add to Plan’.\nSchedule and enrol into the unit in ‘Plan and Enrol’.\nIf you are unable to complete these steps, or are still experiencing issues after attempting them, please submit theEnrolment Support formwith screenshots for further assistance.\nIf the unit was added from a pre-requisite waiver or credit overload request, please DO NOT remove the unit from your study plan and instead, please submit theEnrolment Support Form."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Late-unit-enrolment-FAQ",
    "text": "26 Feb 2025\nKnowledge\nIf you are unable to enrol by the last enrolment date viaeStudent, you may be eligible to apply for late unit enrolment.\n\nPlease find answers to frequently asked questions about Late Unit Enrolment below.\n\nAm I eligible for late unit enrolment?\nReasons for late enrolment may include, but not limited to:\nAdministrative delay\nAttendance mode change\nUnit reinstatement\nAwaiting Visa confirmation\nFamily commitments/difficulties\nPersonal illness\nReceived Course Guidance\nImportant:Late unit enrolment will only be approved in exceptional circumstances. It is your responsibility to catch up in any work or assessments.\n\nWhat is the deadline to apply for late unit enrolment?\nLate Unit Enrolment opens in Week 3 from Monday to Wednesday for Session 1 and 2. For key dates, please visitCalendar of Dates.\n\nOpening\nClosing\nSession 1 2025\n10 March 2025\n12 March 2025\nSession 2 2025\n11 August 2025\n13 August 2025\nNo applications will be accepted after the deadline.\n\nHow do I apply for unit reinstatement?\nYou can apply by submitting your Late Unit Enrolment request via the Service Connect Portal along with an explanation for the initial withdrawal of the unit.\nUnit reinstatement requests must be submitted within 48 hours of withdrawal from the unit and will only be considered up to thestudy period's census date.Any unit reinstatements received after the Census Date will not be processed.\n\nHow do I apply to change the attendance mode for my enrolled unit after the 'Last Enrolment Date'?\nYou can request to change the attendance mode of units you’re enrolled into via theLate Unit Enrolment form. Please submit the late unit enrolment form and any supporting documentation by the deadline.\n\nWhen will I receive the outcome of my late unit enrolment?\nLate Unit Enrolment form can take 3 business days for processing from the day of submission.\n\nWhen do I need to pay my fees if the late unit enrolment is approved?\nIf you are approved for Late Unit Enrolment, you must pay your fees bymidnighton the same day that you are enrolled into.\nImportant:Late fees will be applied the next business day if your fees are not paid on time.\n\nAm I eligible to apply for late unit enrolment for the specified unit if my credit overload request for that unit is approved after the 'Last Enrolment Date'?\nYes, you can apply for Late Unit Enrolment if your credit overload request is approved after the ‘Last Enrolment Date’.\n\nAm I eligible to apply for late unit enrolment if my “Special Approval”request is approved after the 'Last Enrolment Date'?\nYes, you can apply for Late Unit Enrolment if your “Special Approval”is approved after the ‘Last Enrolment Date’.\n\nWhat are the ineligible circumstances for Late Unit Enrolment?\nIneligible circumstances for Late Unit Enrolment include:\nStudents having financial difficulty\nStudents have work commitments\nStudents want to change majors or course in the future study period\nStudent failed to enrol by thelast date to enrol\nRecognition Prior Learning Application was not approved\nStudent doesn't have an approved “Credit Overload/Special Approval” application\nStudent enrolled in a unit for the wrong session\n\n\nRelated article\nHow to apply for Late Unit Enrolment"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Alumni",
    "text": "Graduation\n25 Sept 2024\nKnowledge\nIf you’re a graduate, you’re an alumni!\nYou do not need to 'sign up' to join the alumni community at Macquarie. Once you have completed your studies, whether with a degree or diploma, you automatically become a valued member of the alumni community at Macquarie.\nKeep your contact details up-to-date so that we can send you the latest news, University updates and event invitations.\nFind out more about theMacquarie alumni community.\nRelated articles\nAlumni access to the library and online databases"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Change-Personal-Details-Alumni",
    "text": "19 Sept 2024\nKnowledge"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Campus-card-FAQ",
    "text": "Campus Cards & Opal Concession\n26 Dec 2024\nKnowledge\nWhat is a campus card?\nYour campus card is your identification as a Macquarie University student. It can be used to access a range of resources, facilities and services on campus and is valid for the period of your enrolment.\nExams\nYou must produce your Campus Card to enter the exam venue.\nIf you do not have your Campus Card, you may apply for a temporary exam card, or you can also use your driver licence, passport or NSW government issues photo ID as an alternative to your campus card.\nA Temporary exam card is only available during the final examination period after the last week of the session. You can find out more onCampus Card: Temporary Exam Card.\nLibrary\nYou will need your campus card to use many of the library facilities, including:\nReserving and borrowing resources\nReserving and borrowing resources\nAccessing secured study spaces\nAccessing secured study spaces\nThe library uses the barcode on your card to identify you.\nYou will need your OneID to log into the University network to use the IT facilities.\nReport lost cards to the library immediately. Until the library is notified, you will be liable for any items borrowed by unauthorised use of your lost card.\nYou can find more information inlibrary services.\n\nPrint and Copy\nYour campus card can also be used for printing and photocopying services across the University.\nYou can load funds onto your campus card at recharge stations in the library. Your charges are automatically deducted from your card balance when you use any of the University’s printers or photocopiers.\nYou can also useiPrint, Macquarie University’s united approach to greener printing throughout our campus. You can upload your documents from anywhere, print from anywhere connected to the internet and pick them up from anywhere on campus.\nYou can downloadiPrint softwarestraight to your laptop or submit your document directly toiPrint.\n\nBuilding access\nCampus cars feature a swipe facility enabling you to enter buildings you are authorised to access. Most students will not need access to secured areas on campus. Your department, faculty or unit will advise you if you need to activate your card for swipe access to any buildings or facilities.\nThe Security Service administers all secure building access on campus. You should only use your own card to enter any secured buildings or areas.\nTo enable the swipe access function on your card, you should contact the administrator for the secured area. In most cases, this will be the area’s department, faculty or unit. They will authorise your request and instruct the Security Service to grant you access.\nYou should inform theIT Service DeskorService Connectas soon as possible if your card is lost or stolen to prevent unauthorised entry to secured areas.\nBuilding access will be automatically cancelled and disabled when your card expires, or you leave the University.\nTo use your campus card to access buildings, tap your card against the reader (making good flush contact) and hold it in place for three seconds.\nFor further information about building access, contactCampus Security.\n\nYou will find answers to frequently asked questions about Campus Card below.\n\nI’ve submitted my campus card application. What’s next?\nFor instructions on how to submit your campus card application, please visitCampus Card.\nOnce you have submitted your campus card application, you will receive an email from CaptureMe that will inform you about the status of your request that could be:\nApproved\nApproved\nCard printed\nCard printed\nRejected\nRejected\nYour photo was not accepted\nYour photo was not accepted\nIf your photo was not accepted, you will need to submit a new photo. Photos will be declined if:\nThe background is not plain\nThe background is not plain\nThe photos are too old and not a recent likeness of you\nThe photos are too old and not a recent likeness of you\nThe photos are too filtered or edited\nThe photos are too filtered or edited\nThe photos are provided with improper content\nThe photos are provided with improper content\nPlease read throughCampus Cardfor information on acceptable photos.\nThings to consider\nYour campus card will be sent to the Australian address you have provided in eStudent. Please ensure that your address details are up to date.\n\nWhy was my campus card application rejected?\nIf you have received an email that your campus card application has been rejected, it may be due to various reasons. The reason for rejection could include the following:\nExpired ID Type: you must submit a valid and current ID\nExpired ID Type: you must submit a valid and current ID\nIncorrect ID Type: you must resubmit a valid ID that is in English or with English translation\nIncorrect ID Type: you must resubmit a valid ID that is in English or with English translation\nLow-Resolution ID: you must resubmit your ID in a higher resolution if we cannot read your attached image\nLow-Resolution ID: you must resubmit your ID in a higher resolution if we cannot read your attached image\nID or photo doesn’t match: you must upload an alternative photo or ID if we are unable to verify the two submissions are the same person\nID or photo doesn’t match: you must upload an alternative photo or ID if we are unable to verify the two submissions are the same person\nFor further information, please readCampus Card.\n\nMy card is faulty, doesn’t work or has incorrect details on it. What do I do?\nYou can get a free replacement campus card if:\nYour campus card is deemed faulty/defective\nYour campus card is deemed faulty/defective\nIf the data on the card (i.e. name or student ID) is incorrect at the time of issuing\nIf the data on the card (i.e. name or student ID) is incorrect at the time of issuing\nVisit Service Connect and bring your campus card along with government issued photo ID (e.g. driver licence, passport) to arrange a replacement\nVisit Service Connect and bring your campus card along with government issued photo ID (e.g. driver licence, passport) to arrange a replacement\nAccidental damage can cause parts of the card to stop working. Damage such as punching a hole in a card to attach a lanyard can also shorten the life of the card or stop it working altogether.\nPlease note that if your card is damaged, you need to pay a replacement fee. SeeCampus Card: Replacement.\n\n\nRelated articles\nHow to get my campus card\nReplacement campus card\nTemporary Exam card\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Student-Visa-Conditions",
    "text": "International Student Requirements\n11 Oct 2024\nKnowledge\nIf you are an international student studying with us, you must have a valid Confirmation of Enrolment (CoE) from Macquarie University and have a valid visa from theDepartment of Home Affairs (DHA)for the duration of your course.\nWe have a legal obligation to provide information and to notify the DHA in specific circumstances such as changes to your enrolment and breaches of university policies.\n\nHere are answers to some frequently asked questions about Student Visa Conditions:\n\nWhat are my visa conditions as an international student visa holder?\nWhile on a student visa, you must comply with your student visa conditions set by the Australian Government. If these conditions are breached, it may lead to the cancellation of your visa by the Department of Home Affairs (DHA). Please refer to theDepartment of Home Affairsto review the conditions on your student visa.\n\nWhat other student visa requirements do I need to follow?\nAs an international student on a student visa, it is mandatory to remain enrolled in your course and meet the course requirements throughout your studies. If you are at risk of not satisfying the course progression requirements, we strongly recommend seekingCourse Guidanceto address any concerns.\nELICOS or Foundation Program students must also maintain the minimum requirement for attendance. Please visit theMacquarie University College Attendance Policyfor further information.\n\nWhat if I don’t have a valid visa to stay in Australia?\nIt is unlawful to stay in Australia without a valid visa. If you do not have a valid visa to stay in Australia, please contact theDepartment of Home Affairs (DHA)to check how this may impact you.\n\nWhat if I change my address, phone number and email?\nAs an international student on a student visa, it is important that you keep your details up to date. If your contact details change, you must notify us viaeStudentwithin 7 days of your arrival in Australia or whenever you change your details during your stay in Australia.\n\nWhat does \"one-third of the course\" mean?\nAs an international student on a student visa, you must be onshore and can only study one-third of your course online and/or through distance learning.\nYou must be enrolled in at least one unit that is offered in-person (internal study mode) per compulsory study period (Session 1 & 2 and Term 1 to 4). The only exception to this requirement is if you are completing the last unit of your course which is only available online.\n\nWhat will happen to my CoE status, if I complete my last unit offshore?\nIf you complete your last unit offshore, your CoE will be cancelled, and your international student visa may be affected. This will mean that you may not be eligible for the Post Study Work Rights (PSWR) visa 485.\n\nThings to note\nPlease note that whilst we can provide general advice about your CoE and visa conditions, we are unable to provide further specific advice. You can contact theDepartment of Home Affairs (DHA)for questions related to visas and if you have further questions.\n\nRelated articles\nExtension of Confirmation of Enrolment\nCourse Guidance\nReduce study load\nFull time study load for domestic students"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/NZ-Special-Category-Visa-HELP-Loan-Previous",
    "text": "Commonwealth Support\n30 Oct 2024\nKnowledge\nThe most accurate form of evidence is an International Movements Record available at no cost from theDepartment of Home Affairs.\nPlease be aware that it may take up to 28 days for your application to be completed.\nYou can also submit a previous copy of a VEVO record but need to establish that you meet the residency requirements."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-error-executing-database-command",
    "text": "Class Registration & Timetables\n1 Oct 2024\nKnowledge\nIf you cannot access your ‘My Class Registrations’ page due to ‘Error executing database command’, this may be because you have been registered into multiple options for the same class (tutorial/lecture/practical etc.).\nIf you encounter this error message when trying to register for classes, please check if you have registered in multiple options for the same class when only one class is required. You can check your registration using the Enrolment and Registration Advice document (via eStudent > ‘My Study’ > ‘Manage My Course’ > “Self-Service Reports’). If so, you will need to withdraw* from the unit and re-enrol.\nIf the issue persists after attempting these steps, please submit theEnrolment Support formwith screenshots for further assistance.\n*If you were granted a Credit Overload, Special Approval or Prerequisite Waiver to enrol into the unit, pleaseDO NOTwithdraw from the unit yourself as you may not be able to re-enrol. Please instead submit theEnrolment Support formdetailing the issue and that your enrolment in the unit was dependent on a Credit Overload/Prerequisite Waiver for further assistance."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/credit-overload-eligibility",
    "text": ""
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-Troubleshooting",
    "text": "1 Oct 2024\nKnowledge\nIf you cannot see a unit on your 'My Class Registrations' page, please first check if you have enrolled into the unit.\nIf you are unsure about the enrolment process, please see theEnrollingwebpage for more information.\nIf an enrolled unit is not appearing on your Class Registrations page, it may be because you have enrolled into an ‘Online-Flexible’ attendance mode.If a unit has this attendance mode, all learning activities can be undertaken fully online, however in-person exams are required. This attendance mode will be self-paced and may include scheduled class assessment tasks. You can check in theHandbookto see if the unit is offered in an Online-Flexible attendance mode.You can check what attendance mode you have enrolled into via eStudent > ‘My Study’ > ‘Manage My Course’ > ‘Self-Service Reports’ > ‘Enrolment and Registration Advice’.If you are not enrolled in an Online-Flexible version of the unit, please submit anEnrolment Support formfor further assistance.\nIf a unit has this attendance mode, all learning activities can be undertaken fully online, however in-person exams are required. This attendance mode will be self-paced and may include scheduled class assessment tasks. You can check in theHandbookto see if the unit is offered in an Online-Flexible attendance mode.\nYou can check what attendance mode you have enrolled into via eStudent > ‘My Study’ > ‘Manage My Course’ > ‘Self-Service Reports’ > ‘Enrolment and Registration Advice’.\nIf you are not enrolled in an Online-Flexible version of the unit, please submit anEnrolment Support formfor further assistance."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-eStudent-troubleshooting-error-list",
    "text": "26 Dec 2024\nKnowledge\nBelow are the current roadblocks you might encounter in eStudent and our recommended steps to get around them. If applicable, please follow the troubleshooting steps listed as you may be able to solve the issue yourself. If these steps do not work, please follow the actions listed so we can help you further.\n‘$GOVT_LOAN_SCHM’ error messageRequisite errors– e.g., eStudent incorrectly advises that you do not meet the prerequisites for a unitCannot schedule a unit for a study period it is offered in\"Students who wish to reattempt...” error’Error executing database command’ error messageCannot proceed past submitting my USIError message: “You have previously completed [unit code] ... and may be eligible for advanced standing.”Unable to plan Free Choice units for enrolment (for 2020 Double Degree students)https://connect.mq.edu.au/s/article/Enrolment-student-who-wish-to-reattempt-error\n‘$GOVT_LOAN_SCHM’ error message\nRequisite errors– e.g., eStudent incorrectly advises that you do not meet the prerequisites for a unit\nCannot schedule a unit for a study period it is offered in\n\"Students who wish to reattempt...” error’\nError executing database command’ error message\nCannot proceed past submitting my USI\nError message: “You have previously completed [unit code] ... and may be eligible for advanced standing.”\nUnable to plan Free Choice units for enrolment (for 2020 Double Degree students)https://connect.mq.edu.au/s/article/Enrolment-student-who-wish-to-reattempt-error\nIf your error is not listed, please submit theEnrolment Support formincluding a screenshot of the error and noting any involved units, for further assistance."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Exam-Preparation",
    "text": "Exam Support\n4 Dec 2024\nKnowledge\nHere are some things to be mindful of before sitting an exam:\nMake sure you have your photo ID sorted out and ready for exam day.\nKnow the date, start-time, exam location for each exam you are scheduled to sit – see theExam timetable webpage.\nFamiliarise yourself with the rules and procedures relevant to sitting a formal exam.\nMake sure you are aware of your responsibilities when it comes to academic integrity.\nEnsure you have ready the required aids and materials for each exam, including stationery such as pens, pencils, eraser, and calculator (if applicable).\nTips to help support and prepare for your exam:\nRead through your unit guide carefully at the start of the session to make sure you are aware of when you need to be ready for your exam.\nVisitStudyWISEfor advice on preparing for your exam.\nThe Academic Integrity module provides overview of academic integrity in online exams.\nCheck out Wellbeing’s student blog on Dealing with exam stress.\nHave a look at De-stress for success for events to help manage exam stress (usually updated with events closer to start of main Session exam period)."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Exam-Day",
    "text": "Exam Support\n4 Dec 2024\nKnowledge\nHere are some tips for on the day:\nArrive early to ensure you have enough time to find your exam room. You will be allowed to enter the exam room 10 minutes before the start of the exam.\nEnsure you have the required materials for each exam, including stationery such as pens, pencils, eraser, and calculator (if applicable).\nWhen you are given the instruction from the exam supervisor to commence working (usually after reading time has ended), complete the details on the yellow exam attendance form before starting to answer any questions. Supervisors will come around to each student during the first 30 minutes of working time to collect these forms and check the details against your identification card. You will not be given extra time to complete this task once exam working time has been completed.\nIf you forget your photo ID on the day of your exam, go to Service Connect for a temporary exam card (ground floor, 18 Wally’s Walk)."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Exam-Timetable",
    "text": "Exam Support\n1 Oct 2024\nKnowledge\nExam timetable release dates can be found on theExams Timetablepage.\nOnce released, you will be able to check the time and date of your exam as well as your room and seat allocation by entering your OneID and password under Student Personalised Timetable.\nFor more information about exams, please visit theExamswebpage.\n\nRelated article\nExam Clash\nExam Changes\nExam Support"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Supplementary-Exam-Approval",
    "text": "Exam Support\n25 Sept 2024\nKnowledge\nOnce you have applied for a supplementary exam throughSpecial Consideration, the University will assess the information and evidence you have provided and aim to provide an outcome of your application via your student email address within 5 working days of receipt of the application.\nImportant:Application outcomes may take 5-10 working days during peak periods.\n\nRelated article\nSupplementary Exam\nExam Support\nExam Timetable"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Supplementary-Exam",
    "text": "Exam Support\n25 Sept 2024\nKnowledge\nYou are expected to attend exams at the date and time designated in theMacquarie University Examination Timetableand it is your responsibility to be available during the official examination period.\nIf you are sick or absent due to serious and unavoidable circumstances, you need to requestSpecial Consideration. If you have ongoing responsibilities or an ongoing condition (eg. carer responsibilities, chronic illness, etc.) that you know of prior to your exam, you may be able to register with our Accessibility Service. For other situations relating to non-attendance at exams, speak to your Unit Convenor for advice.\n\nRelated article\nExam Support\nExam Timetable\nExam Clash"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Script-View",
    "text": "Exam Support\n25 Sept 2024\nKnowledge\nIf you want additional feedback on any assessment including your final exams, please contact the relevant Unit Convenor viaiLearn.\nExam script viewing is also available to students wishing to apply for aGrade Appeal.To organise a viewing of your exam script you will need to contact the relevant Unit Convenor viaiLearn.\nMQBS students should not contact their Unit Convenor and will instead need to register for an exam script viewing session.\n\nRelated articles\nResults\nGrades\nGrade Appeal"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Past-Papers",
    "text": "Exam Support\n25 Sept 2024\nKnowledge\nYou can find past exam papers for many of your units using theLibrary's Multisearch tool.\nDue to the change in unit delivery during COVID-19, Session 1 2020 and Session 3 2020/21 final exam papers are not published.\nIt is recommended you also view the 'Exam period assessment' tab iniLearnto see if there are practice tests. These have been designed to allow you to become familiar with how the exam will run on the day both in terms of the type of questions you may get.\n\nRelated article\nExam Support\nExam Timetable"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Appealing-a-University-Decision",
    "text": "Academic Appeals\n25 Sept 2024\nKnowledge\nMacquarie University is committed to a transparent, equitable and consistent approach on decisions that affect students.\nIf you have been notified of a decision made by the University and you are not satisfied with the decision-making process, you may be able to lodge an appeal.\nNot all decisions can be appealed, however the decisions that can be appealed are outlined in theAppeals information, including links to the relevant rules, policies and procedures.\nYou should submit yourAppeal ApplicationviaService Connect Portal.\nIf you are uncertain of the procedures or need help to submit your appeal, contactStudent Advocacyfor advice.\n\nRelated articles\nAcademic Appeals"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Refund-Request-International",
    "text": "11 Oct 2024\nKnowledge\nIf you are an international student and your account is in credit, you may be entitled to a refund if you are:\nin the last semester of your study\nwithdrawing completely from your course\ngiven special consideration\nBefore you begin\nCheck thekey dates\nEnsure you review theInternational fee refund policybefore applying\nRefer toRefund for International Studentsfor information on how to apply\nYou can find answers to frequently asked questions about refund for International students below.\n\nI have not started my studies; however, I want to apply for a refund.\nIf you have not commenced your study at Macquarie University, you can apply for a refund by completing theInternational withdrawal and release request form. Once completed, you can return this form and supporting documents to your International Admissions Officer.\n\nHow can I apply for a refund if I am a current Macquarie University student?\nIf you are a current Macquarie University Student, you can complete theInternational request for fee refund formif your withdrawal has been finalised.\n\nI want to apply for a refund of my tuition and/or OSHC fees.\nStudents who organised their Overseas Students Health Cover (OSHC) through Macquarie University and have not arrived in Australia can organise the refund by lodging theInternational withdrawal and release request form.\nOnce you have arrived onshore, you should contact your OSHC provider directly for a refund.\n\nYou can find further information onRefund for Interantional Students."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Exam-Changes",
    "text": "Exam Support\n25 Sept 2024\nKnowledge\nYou are expected to attend exams at the date and time designated in theMacquarie University Examination Timetable.\nIf you have been allocated an in-person examination but need to sit your exam off-campus and online, use the application form listed in yourPersonalised Exam Timetableto apply for an online exam.\nTo be considered for an online exam you must:\nBe enrolled in the online offering of your unit(s); and\nBe located either offshore, regional NSW, or out-of-state (and have been for the entirety of the session)\nQuick tip:If you do not meet the above criteria but believe you have an exceptional reason for changing your exam sitting, you are encouraged to apply for Special Consideration.\n\nRelated Article\nSpecial Consideration\nExam Clash\nExam Support\nExam Timetable"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-Support",
    "text": "25 Sept 2024\nKnowledge"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Verification-for-current-students",
    "text": "4 Dec 2024\nKnowledge\nStatus Letter\nA status letter confirms your current enrolment status and can be used to provide proof of your current enrolment. You may find more information including how to request one viaStatus Letter.\n\nTranscript\nDigital My eQuals Transcript\nIf you are a current student, or have studied with us since 2008, you can share your digital My eQuals Transcript with any third party you choosevia My eQuals.\nThe documents are secure and certified by the system, ensuring their authenticity.You maintain control of who you share your documents with and how long the link is valid.\nYou can find more information about and instructions on how to request a digital copy of your transcript via My eQuals fromTranscript request – Post 2008.\n\nOfficial Academic Transcript:\nYou can provide your Academic Transcript to third parties to verify your studies, no matter when you studied with us.\nIf you commenced your course and did not graduate, this document will verify the units you completed with us. You can find more information including how to request a transcript viaTranscript.\n\nRelated articles\nVerification by Third Party\nVerification for Previous Macquarie University student/Alumni\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Verification-for-previous-student-alumni",
    "text": "4 Dec 2024\nKnowledge\nGraduate Register\nIf you were apreviousstudent with us or an alumni, you can direct third parties to our Graduate Register webpages to find all past Macquarie University awards, including your current formal name, degree title and conferral date:\nPre-2002 graduate register (1970-2001)\nGraduate Register (2002 onward)\nGraduation Documents\nIf you have graduated, you may also provide a third party withgraduation documentsto verify your studies with us. This includes:\nTestamur\nTranscript\nAHEGS(if eligible)\nIf you were a studentfrom2008, you can securely share your digital graduation documents with any third party you choose viaMy eQuals.The documents are secure and certified by the system, ensuring their authenticity and you maintain control of who you share them with and how long the link is valid.\n\nIf you were a studentbefore2008, we cannot issue digital graduation documents, however you can use your hardcopy documents. For more details on how to order a replacement transcript, refer toTranscript request: pre-2008.\n\nIf these options do not apply to youand you would like to request verification of your studies, please follow the steps below:\nSubmit a structured enquiry via theService ConnectPortal\nAttach a document requesting verification and what information is required\n\nYou can find answers to frequently asked questions on verification for previous Macquarie University students or alumni.\n\nWhat documentation is required?\nIf you determine that the available resources are insufficient and you submit a verification request, you must abide by our privacy and consent requirements.\nFor previous students, we must verify your identity through a privacy check verbally (via phone call) or in writing.\nOnce you have submitted a verification request, further instructions (if required) may be requested in order to meet our privacy verification requirements.\nWhat do I do if I want to check my Superannuation qualification?\nf you have previously studied superannuation with us, you cannot access your Superannuation qualification through the general transcript portal. You must contactThe Association of Superannuation Fund of Australia (ASFA)on 02 9264 9300.\nWhat do I do if I studied my degree through ICMS?\nIf you havestudiedyour degree though theInternational College of Management Sydney (ICMS), you must contact ICMS directly to access your transcript. Your transcript will not appear on Macquarie University's system.\nYou can use the following contact details to contact ICMS:\nT:1800 657 572 or 02 9977 0333\nRelated articles\nVerification by Third Party"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Verification-by-Third-Party",
    "text": "4 Dec 2024\nKnowledge\nIf you are seeking to verify the graduation or degree of a previous Macquarie University student, please visit theGraduate Register. This is a free service offered to third parties who wish to confirm the educational background of a previous student.\nImportant:This publicly accessible information is in accordance with the NSW Privacy Act.\n\nYou will find answers to frequently asked questions about Verification below.\n\nWhat information does the Graduate Register provide?\nThe Graduate Register states the previous student’s:\nConferral of an award\nName of award (excluding Majors and Specialisations)\n\nIs the Graduate Register for all graduates?\nPlease ensure that you use the relevant Graduate Register:\nFor Pre 2002 (1970-2001), please refer topre 2002 Graduate Register\nFor 2002 onward, please refer to2002 onward Graduate Register\n\nWhat documentation is required?If you determine that the available resources are insufficient and submit a verification request you must  abide by our privacy and consent requirements.For third parties, a consent form must be completed that includes the students' full name, date of birth and signature. The student must provide authorisation for Macquarie University to release information relating to their studies.Once you have submitted a verification request, further instructions (if required) may be requested in order to meet our privacy verification requirements.\nIf you determine that the available resources are insufficient and submit a verification request you must  abide by our privacy and consent requirements.\nFor third parties, a consent form must be completed that includes the students' full name, date of birth and signature. The student must provide authorisation for Macquarie University to release information relating to their studies.\nOnce you have submitted a verification request, further instructions (if required) may be requested in order to meet our privacy verification requirements.\n\n\nRelated article\nVerification for current students"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Third-Party-Authority-how-to",
    "text": "15 Oct 2024\nKnowledge\nHow do I submit a Third Party Authority form?\nTo submit aThird Party Authority form, follow the steps below:\nSelect 'Services' from the top menu options in theService Connect portal\nClick on Support at MQ\nClick on university documents and record management\nSelect Third Party Authority.\nFill in the required details and ensure your nominated Third Party Authority is aware of what they can and can't access and how we will confirm we are speaking to the person you nominate.\nOnce you have submitted theThird Party Authority formyou can always amend or discontinue access at any time.\n\nRelated article\nThird Party Authority"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Third-Party-Authority-what-is",
    "text": "15 Oct 2024\nKnowledge\nWhat is Third Party Authority?\nAThird Party Authority formallows you to nominate someone to act on your behalf or access your personal and/or student records on your behalf.\nYou can grant them authority to access certain information or documents e.g. your application, enrolments and results. or fees.\nPlease make sure your nominated Third Party is aware of what they can and can't access and how we will confirm we are speaking to the person you nominate\n\nRelated article\nHow to apply for Third Party Authority"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Residency-Verification-Former-Permanent-Resident-Humanitarian-Visa-Holder",
    "text": "3 Oct 2024\nKnowledge\nTo change or verify your residency, you must inform us by submitting theResidency Verification formwith appropriate documentation prior to the nextcensus dateof your study period.\nThis article has answers to questions about Residency Verification forPermanent Resident (Humanitarian) visa holders.\n\nI am a former Permanent Resident (Humanitarian) visa holder, can I apply for a HELP loan to pay my fees?\nFrom 1 January 2022, legislation was introduced to allow some former Humanitarian visa holders to retain eligibility to defer the cost of their tuition fees to theAustralian Taxation Office (ATO)via a HELP loan.\nTo find out if you are eligible, please visit Australian Government’sStudyAssistand search for information under “Non-Australian citizens”.\n\nHow do I apply for a HELP loan as a former Permanent Resident (Humanitarian) visa holder?\nIf you believe you meet the criteria to apply for a HELP loan as a former Permanent Resident (Humanitarian) visa holder, you will need to submit:\na copy of the photo page of your passport or\na copy of your ImmiCard via aResidency Verification formand university staff will verify your residency status onVEVO\n\nI have submitted my application, what happens next?\nIf your application is successful, you will be advised to submit a neweCAFfor HECS-HELP or FEE-HELP, if you haven’t already done so, with your Tax File Number (TFN).\n\nRelated Articles\nResidency Verification – FAQ\nResidency Verification – Permanent Residents (Non-humanitarian) or New Zealand Citizens\nResidency Verification – Australian citizen\nResidency Verification –PermanentResident Humanitarian\nHow to update my residency status?"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Residency-Verification-FAQ",
    "text": "3 Oct 2024\nKnowledge\nIf your residency status has changed, you are required to inform us immediately as this may affect the rate you are charged for your tuition fees.\nTo make this change, you will need to inform us by submitting theResidencyVerificationformwith appropriate documentation prior to the nextcensus dateof your study period as per one of the categories below:\nRequest a change of residency status at Macquarie University\nBecoming a Permanent Resident (Non-humanitarian) or New Zealand citizen\nBecoming an Australian citizen\nPermanent Resident (Humanitarian)\nFormer Permanent Resident (Humanitarian)\n\nThings to note:Please choose an article below with further information about each residency type.\n\nDo I need to submit a new electronic Commonwealth Assistance Form, eCAF?\nYes, you must submit a neweCAF, before the nextcensus dateto complete your change of residency status and to ensure that the correct tuition fees are charged.\nYou will also be required to submit yourUnique Student Identifier (USI)and your Tax File Number (TFN) if you are eligible to borrow the cost of your tuition fees.\n\nWhen will I receive the outcome of my change of residency application?\nYou will receive an email with the outcome of your application within 15 business days from the date of submission.\n\n\nRelated Articles\nResidency Verification – Permanent Residents (Non-humanitarian) or New Zealand Citizens\nResidency Verification – Australian citizen\nResidency Verification –PermanentResident Humanitarian\nResidency Verification –Former Permanent Resident (Humanitarian) Visa holder\nHow toupdatemy residency status?\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Campus-card-replacement",
    "text": "Campus Cards & Opal Concession\n15 Oct 2024\nKnowledge\nIf you have lost or damaged your campus card, you can order a replacement campus card online using our online payment gateway.\nYou can also request a new campus card to update your photo.\nWhen requesting your replacement card you can choose from the following options:\nCollect your campus card in person\nCollect your campus card in person\nComplete thecampus card replacement request formto pay for your cardVisit Service Connect on the Ground Floor, 18 Wally’s WalkBring your receipt and a valid form of photo ID, i.e. driver licence, passport\nComplete thecampus card replacement request formto pay for your card\nComplete thecampus card replacement request formto pay for your card\nVisit Service Connect on the Ground Floor, 18 Wally’s Walk\nVisit Service Connect on the Ground Floor, 18 Wally’s Walk\nBring your receipt and a valid form of photo ID, i.e. driver licence, passport\nBring your receipt and a valid form of photo ID, i.e. driver licence, passport\nHave your campus card posted to you\nHave your campus card posted to you\nComplete thecampus card replacement request formto pay for your cardChoose to have it posted to your nominated postal addressYour existing photo in the system will be used for this optionAn extra $1.25 will be added to the replacement cost to cover postage\nComplete thecampus card replacement request formto pay for your card\nComplete thecampus card replacement request formto pay for your card\nChoose to have it posted to your nominated postal address\nChoose to have it posted to your nominated postal address\nYour existing photo in the system will be used for this option\nYour existing photo in the system will be used for this option\nAn extra $1.25 will be added to the replacement cost to cover postage\nAn extra $1.25 will be added to the replacement cost to cover postage\nPay and collect your campus card in person\nPay and collect your campus card in person\nVisit Service Connect on the Ground Floor, 18 Wally’s Walk and bring your own deviceComplete thecampus card replacement request formto pay for your cardOnce payment has been processed and a receipt issued, present this to the Service Connect staff at the Service Desk with a government issued photo IDYour campus card will be printed\nVisit Service Connect on the Ground Floor, 18 Wally’s Walk and bring your own device\nVisit Service Connect on the Ground Floor, 18 Wally’s Walk and bring your own device\nComplete thecampus card replacement request formto pay for your card\nComplete thecampus card replacement request formto pay for your card\nOnce payment has been processed and a receipt issued, present this to the Service Connect staff at the Service Desk with a government issued photo ID\nOnce payment has been processed and a receipt issued, present this to the Service Connect staff at the Service Desk with a government issued photo ID\nYour campus card will be printed\nYour campus card will be printed\nImportant:Once a replacement campus card has been issued, the previous lost/damaged card becomes invalid and unable to be used.\n\nMy card is faulty, doesn’t work or has incorrect details on it. What do I do?\nYou can get a free replacement campus card if:\nYour campus card is deemed faulty/defective\nYour campus card is deemed faulty/defective\nIf the data on the card (i.e. name or student ID) is incorrect at the time of issuing\nIf the data on the card (i.e. name or student ID) is incorrect at the time of issuing\nVisit Service Connect and bring your campus card along with government issued photo ID (e.g. driver licence, passport) to arrange a replacement\nVisit Service Connect and bring your campus card along with government issued photo ID (e.g. driver licence, passport) to arrange a replacement\nAccidental damage can cause parts of the card to stop working. Damage such as punching a hole in a card to attach a lanyard can also shorten the life of the card or stop it working altogether.\nPlease note that if your card is damaged, you need to pay a replacement fee. SeeCampus Card: Replacement.\n\nRelated articles\nCampus Card FAQ\nHow to get my campus card?\nTemporary exam card"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Campus-card-temporary-exam-card",
    "text": "Campus Cards & Opal Concession\n14 Oct 2024\nKnowledge\nA temporary campus card is available for students who do not have their campus card or any other government issued ID to prove their identity for assessment purposes. .\nFor students who require temporary campus cards during as assessment. This service will be available at Service Connect. If it is during the final exam period you can obtain your campus card half an hour before on-campus exams commence each day and one hour after the start time of the last on-campus exam each day.\nAs well as your campus card or a temporary campus card issued by Service Connect, you can also use these methods of photo identification to enter an exam venue:\nAustralian driver licence (Service NSW Digital driver’s licence accepted)\nAustralian driver licence (Service NSW Digital driver’s licence accepted)\nAustralian/NSW photo ID card\nAustralian/NSW photo ID card\nPassport\nPassport\nIf you do not have your campus card or other appropriate ID with you for any reason on a day when you have an exam, Service Connect will issue a temporary exam card that is only valid for one day. This temporary pass is free but will invalidate your current campus card.\nYou must have one of the above IDs or havereplaced your campus cardfor a fee of $15 before your next exam.\n\nRelated articles\nCampus Card FAQ\nReplacement campus card\nHow to get my campus card?"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Campus-card-how-to-apply",
    "text": "Campus Cards & Opal Concession\n14 Oct 2024\nKnowledge\nTo get your campus card, please follow the steps below:\nBefore you begin\nYou must ensure that you have enrolled in at least 1 unit ineStudent.\nLogin toCaptureMe\nLogin toCaptureMe\nEnter your personal details (your name, student ID and email address)\nEnter your personal details (your name, student ID and email address)\nOnce your details have been verified, you must upload a photo of yourself.Acceptable photo\nOnce your details have been verified, you must upload a photo of yourself.Acceptable photo\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/OSHC-INTL-UG-PG-MQ-College",
    "text": "International Student Requirements\n25 Sept 2024\nKnowledge\nIf you need to extend your visa, you will need to make sure you have enough health cover.\nThe following list indicates how long you must haveOverseas Student Health Cover (OSHC) for.\nIf you are completing your study program at the end of:\nSession 2 - you will need to extend your OSHC until 15 March of the following year.\nSession 1 - you will need to extend your OSHC until 30 August of the same year.\nOther - you cover needs to expire two calendar months after the course completion date\nTo find more information please visitOSHCand the government's private health website.\n\nRelated article\nStudent Visa Conditions\nExtension of COE"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Graduation-documents",
    "text": "Graduation\n1 Oct 2024\nKnowledge\nOnce you graduate, you will receive a digital copy of your testamur, official academic transcript and AHEGS via My eQuals within 2 weeks after your conferral date. At your graduation ceremony you will receive a hard copy of your: testamur, and official academic transcript. Only eligible degrees receive a complimentary hard copy of their AHEGS.\nYou will find answers about testamurs and AHEGS below.\n\nWhat is a Testamur?\nYour Macquarie University testamur certified that you have been awarded your degree or diploma. It is also sometimes referred to as a graduation certificate, diploma or parchment.\nThe testamur is an A4 sized document that contains the Arms of the University, University seal, Signatures of the Vice-Chancellor and Registrar, Name of the graduate, Name of the degree/diploma and Conferral date.\nAdditional illustrations and text may appear on certain testamurs issued by the University depending on the nature of the award.\nImportant:There can only be one testamur in circulation for a graduate of the degree for which they were awarded. Copies will not be produced by the University unless requirements for a replacement are met.\n\nWhat is on AHEGS document?\nAn AHEGS or Australian Higher Education Graduation Statement is a statement which recognises students’ participation in a wide range of activities during their studies. An AHEGS may be issued in addition to other documents, such as testamurs and academic transcripts.\nThe contents of an AHEGS includes a description of the nature, level, context and status of studies that were pursued by the individual named as well as information about the education provider.\nThe purpose of AHEGS is to assist in both national and international recognition of Australian qualifications and to promote international mobility and professional recognition of graduates. Students at Macquarie University who have their qualification for an Award ratified by Academic Senate or a Faculty Board on or after 16 December 2010 may be eligible to receive an AHEGS.\n\nWhat does an AHEGS look like?\nThe AHEGS consists of five sections:\nSection 1: The Graduate – Student details (family name, given names and student number)\nSection 2: The Award – Full title and details of the award and details of any course accreditation\nSection 3: The Awarding Institution – Details of the awarding institution\nSection 4: The Graduate’s Academic Achievements – includes major(s)/specialisation(s), details of individual graduate’s achievements, listing details of units undertaken towards the award. This section also includes details about special achievements, recognition and prizes. It may also include additional achievements outlining student’s involvement in recognised co-curricular activities.\nYou can read more onAHEGS Recognised Co-curricular activities.\nSection 5: Description of the Australian higher education system – The content for this Section is provided by the Australian Government and will be included as required.\n\nFor further information about AHEGS, read more atAHEGS Policy.\n\nRelated articles\nReplacement testamur"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Graduation-in-Absentia-documents",
    "text": "Graduation\n1 Oct 2024\nKnowledge\nIf you do not wish to attend your graduation ceremony, you will need to complete theGraduating in Absentia formvia theService Connect Portalto nominate how you would like to receive your graduation documents.\nPlease choose how you would like to obtain your graduation documents and follow the instructions below.\n\nHow do I elect to have my graduation documents delivered to me via mail?\nIf you elect to not attend your graduation ceremony and require your documents to be sent free of charge, you can select the MAIL option for Graduation in Absentia.\nYou must allow at least three (3) weeks for domestic delivery (or eight (8) weeks for international delivery) for delivery before inquiring about documents not received.\nEnsure that your preferred postal address and contact phone number in eStudent are always up to date so that your graduation documents are correctly delivered.\nPlease note that tracking is not available for this option and the University does not take responsibility for lost packages and you will be liable to pay the replacement testamur fee if this occurs.\n\nHow do I elect to have my graduation documents delivered to me via courier delivery?\nIf you elect to not attend your graduation ceremony and require your documents to be sent by Express Post/DHL/TNT international courier (fee incurred), you may elect the COURIER option in the web form.\nYou must allow at least two weeks before inquiring about documents not received. Delivery by courier is accompanied with a tracking number.\nYou will be liable to pay the courier fee again if you did not receive your graduation documents due to an incorrect address supplied to the University.\n\nHow do I collect my graduation documents in person?\nIf you elect not to attend your graduation ceremony and wish to collect your documents in person, you should elect the COLLECT option on the web form.\nWe will let you know when your documents are ready to be picked up from Service Connect, Ground Floor, 18 Wally’s Walk, Wallumattagal Campus.\nCollection times are from Monday – Friday 10am – 3pm.\nImportant:You will not be able to collect your graduation documents during graduation ceremonies and other dates when the Graduation Team will be away from the office. This includes the following blackout periods for 2024:\nThursday 26 September – Tuesday 15 October 2024.\nIf you need any amendments in your Graduating in Absentia form, please submit an enquiry via theService Connect Portal.\n\nRelated articles\nGraduation: Defer Ceremony"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Transcript-pre-2008",
    "text": "21 Jan 2025\nKnowledge\n\nI studied before 2008. How can I collect my transcript?\nTo collect your transcript, you must complete theTranscript Request form.\nOnce this has been approved, you will receive an email with a link to the payment gateway. processing times for your transcript will upon payment.\n\nI studied before 2008. How can I get my transcript sent to me?\nTo have your transcript sent to your nominated address, you must complete theTranscript Request form.\nOnce this has been approved, you will receive an email with a link to the payment gateway. processing times for your transcript will upon payment.\n\nI need to send my transcript to an Australian organisation or institution.\nTo have your transcript sent to an Australian organisation or institution, you must complete theTranscript Request form. You can add a note including the name and address of the Australian institution.\nOnce this has been approved, you will receive an email with a link to the payment gateway. processing times for your transcript will upon payment.\n\nHow can I share my transcript to World Education Services (WES).\nTo share your transcript with World Education Services (WES),you must complete theTranscript Request form..\nOnce this has been approved, you will receive an email with a link to the payment gateway. processing times for your transcript will upon payment.\n\nCan I get a digital copy of my transcript?\nDue to system limitations, we can only provide hard copies to students who studied prior to 2008.\n\n\nRelated articles\nTranscript FAQ\nThird party authority\n\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Change-Personal-Details-title-gender-preferred-name",
    "text": "1 Oct 2024\nKnowledge\nTo update your preferred name or title\nPlease submit aChange Personal Details Requestform. You do not need to provide official documentation.\nTitle updates will be reflected on official correspondence from the university.\nPreferred name updates will be reflected in iLearn, eStudent, exam and tutorial rolls.\nPlease note that neither change will be reflected on transcripts, testamurs or other official University documentation.\nQuick tip\nOnce you've updated your formal or preferred name with Service Connect: if you would like this change reflected in your student email address, please contact theIT Service Desk.\n\nTo update your gender\nYou will need to provide documentation reflecting the requested change (such as a passport, birth certificate or medical practitioner's letter). This documentation does not need to be certified.\nPlease submit your documentation along with aChange Personal Details Requestform."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/NZ-Special-Category-Visa-HELP-Loan-Evidence",
    "text": "29 Oct 2024\nKnowledge\nYou will need to show that you have been ordinarily resident in Australia by showing continuity of residency.\nExamples of proof include:\nAn International Movement Record (the most comprehensive form of evidence available from theDepartment of Home Affairs, allow 28 days for processing)\nAustralian academic transcripts (including VET transcripts) dated when you were a minor\nSchool reports or certificates\nEnrolment papers from when you were a minor\nAustralian proof of age card from when you were a minor\nAustralian student ID card or concession card\nStamped passport\nPayslips or payment summaries from when you were a minor\nCertificate of application for a Tax File Number, Tax File Number advice or notification of assessment of income tax dated from when you were a minor.\n\nPlease Note:\nYou must provide all the required documents and be assessed as eligible by the next relevant census date to be able to defer your fees for that particular session. Otherwise, you will be required to make full payment of fees to the University for that session."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/NZ-Special-Category-Visa-HELP",
    "text": "Commonwealth Support\n30 Oct 2024\nKnowledge\nA New Zealand citizen on a Special Category Visa (or previously held a Special Category Visa (SCV)), could be eligible to borrow the cost of tuition fees from the Commonwealth government and repay the amount borrowed via the Australian Tax Office (ATO) as long as you meet eligibility requirements.\nTo be eligible you must:\nmeet the long-term residency requirements. and\nbe living in Australia for the duration of your course of study"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/NZ-Special-Category-Visa-HELP-Loan-Eligibility",
    "text": "Commonwealth Support\n30 Oct 2024\nKnowledge\nIf you believe you meet all the SCV criteria and would like to request HELP assistance, complete the following before the next relevant census date.\nComplete the complete thechange of Citizenship/Residency Statusform\nProvide a copy of your NZ passport as evidence that you currently hold a NZ Special Category Visa (SCV)\nShow that you have been ordinarily resident in Australia for at least 10 years, and\nthat you were under the age of 18 without a spouse or de facto partner when you first began to be ordinarily resident in Australia, and\nthat you have been in Australia for at least:a total of eight out of the past 10 years; anda total of 18 months out of the last two years\na total of eight out of the past 10 years; and\na total of 18 months out of the last two years"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Permanent-Resident-Humanitarian",
    "text": "2 Oct 2024\nKnowledge\nIf you are a Permanent Resident on a Humanitarian visa, you must submit one of the following via theResidency Verification formincluding:\na copy of the photo page of your passport or\na copy of your ImmiCard University staff will verify your residency status on VEVO.\n\nI have submitted my application, what happens next?\nIf your application is successful, you will be advised to submit a neweCAFfor HECS-HELP or FEE-HELP, if you haven’t already done so, with your Tax File Number (TFN).\n\nRelated articles\nResidency Verification – FAQ\nResidency Verification – Permanent Residents (Non-humanitarian) or New Zealand Citizens\nResidency Verification – Australian citizen\nResidency Verification –Former Permanent Resident (Humanitarian) Visa holder\nHow to update my residency status?"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Student-Services-and-Amenties-Fee-refund",
    "text": "11 Oct 2024\nKnowledge\nIf you withdraw from your unit/s after the census date, you remain liable for the Student Services and Amenities Fee.\nThe liability is based on your enrolment load at census date.\nEven if a refund has been approved for withdrawal without penalty from your unit/s due to special circumstances, the Student Services and Amenities Fee cannot be refunded."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Government-Loans-INTL-UG-PG-MQ-College-Future",
    "text": "19 Sept 2024\nKnowledge\nIf you are from the United States, Europe or Canada you may be able to apply for a student loan from your home country to cover the costs of studying at Macquarie.\nImportant:Applications are dependent on your home country.\nTo find out more please visitInternational Loan Scheme.\nFor further information and to submit your forms, you can contact a Financial Aid Coordinator:\nE:financialaid@mq.edu.au"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Assignment-Retrieval",
    "text": "Exam Support\n19 Sept 2024\nKnowledge\nIn many cases, it is possible to retrieve your submitted assignment files by clicking on the link to that assignment and then on your assignment file.\nHowever, it may depend on how your Convenor has set up the assignment as there are a number of different settings available.If it is past the due date, then you may no longer be able to access the assignment. If this is the case, you will need to contact your Convenor.\nMore information on Assignments can be found iniLearn."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/CPA-CA-Enrolment",
    "text": "25 Sept 2024\nKnowledge\nIf you are enrolled in the Master of Professional Accounting (CPA Studies), you need to enrol in CPA units with Macquarie University and CPA Australia.\nYou will need to submit a MacquarieCA/CPA Enrolment Form.\nContact CPA Australia directly to arrange enrolment in the CPA Program (Professional).\nQuick Tip:Always refer toCPA Australiato confirm important dates.\nEnrolment fees are payable to Macquarie University and CPA Australia separately."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Sanctions-USI",
    "text": "1 Oct 2024\nKnowledge\nIf you have a sanction related to your Unique Student Identifier (USI), you will need to lift this sanction before you are able to enrol. There are two main types of USI sanctions:\nUSI Not Provided: If you have not provided your USI, you will be prevented from enrolling until you have provided this. You can submit your USI, via eStudent > ‘My Forms’. If you do not have a USI, or are not sure what your USI is, you can find your USI in theUSI portal.\nUnverified USI: If eStudent advises that your USI cannot be verified, you will need to check that all your details match across eStudent and the USI registry, as well as with the Australian Taxation Office (if you are a domestic student), or with the Department of Home Affairs (if you are an international student).\nPlease ensure that all of the following details match:\nFirst/given name(s)*\nMiddle name(s)*\nLast/surname\nDate of birth\n*International students please note that the Department of Home Affairs and many passports do not differentiate between first names and middle names. Any middle name should be placed in the ‘First/Given Names’ section across USI and eStudent, as is displayed with Department of Home Affairs.\nIf your details are incorrect with the university, you can update them via the Change of Personal Details form. If your details are incorrect with USI, you will need to update them via theUSI portal.\nOnce your details match, please allow up to 5 business days for the sanction to lift."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-Troubleshooting-Cannot-Proceed-Past-USI-Submission",
    "text": "1 Oct 2024\nKnowledge\nYou can submit your USI via eStudent > ‘My Forms’.\nIf you have attempted to submit your USI but are still unable to enrol as the USI mandatory task has not cleared, please submit theEnrolment Support formexplaining that you have not been able to submit your USI through eStudent and including your USI number.\nPlease ensure you have attempted to submit your USI prior to submitting the form."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Enrolment-GOVT-LOAN-SCHM-error-message",
    "text": "1 Oct 2024\nKnowledge\nWhen trying to enrol, if you encounter the error message ‘$GOVT_LOAN_SCHM’, this is generally a temporary error that should not prevent you from enrolling.\nRefresh the page and try again to enrol. If this does not work, try enrolling in just one unit at a time.\nYou may also want to try logging out and back into eStudent or trying a different browser.\nIf you are still not able to enrol after attempting these steps, please submit theEnrolment Support formwith a screenshot of the error for further assistance."
  },
  {
    "url": "https://connect.mq.edu.au/s/article/TFN",
    "text": "19 Sept 2024\nKnowledge\nStudents will need to provide their Tax File Number (TFN) by the census date before they can defer their fees via HECS-HELP.\n\nI have a TFN. How do I provide it?\nFill out the HECS-HELP form oneStudentand provide your TFN.\n\nI don't have a TFN. What should I do?\nIf you do not have a TFN, you will need to apply for TFN. Note that it may take up to 28 days for the ATO to process your application. Once you receive your TFN you will need to fill out the HECS-HELP form again with your TFN provided.\nIf the census date is less than 2 weeks away and you do not have a TFN, please submit an enquiry viaService Connect Portal.\n\nFor more information about TFN please visitCompleting an eCAF.\n"
  },
  {
    "url": "https://connect.mq.edu.au/s/article/Leave-of-Absence",
    "text": "1 Oct 2024\nKnowledge\nWe understand that circumstances can change, which is why you may want to take leave of absence.\n\nWhat is leave of absence?\nWith leave of absence, you can take a break from your studies for up to 12 months. This is the maximum leave entitlement during your course.\n\nWho can apply to take leave of absence?\nCurrent domestic students can apply for leave of absence.\n\nI am an international student. Can I apply for leave of absence?\nNo. If you are an international student, you can only take a break from your studies due to compelling or compassionate circumstances via Suspension of Studies.\n\nCan I take leave of absence for six months instead of 12 months?\nYes, you can apply for leave of absence for six months (that is, for one session) with the following exceptions:\nDoctor of Medicine\nDoctor of Physiotherapy\nMaster of Speech and Language Pathology\nMaster of Clinical Audiology\nYou can only apply for leave of absence for 12 months (that is, two consecutive sessions) if you are enrolled in one of these courses.\n\nI didn't enrol or apply for Leave of Absence!What happens now?\nAn application for leave of absence will be submitted on your behalf for one study period and this will count toward to your maximum leave duration for your admitted course.\n\nI am on Academic Pause. Do I need to take leave of absence?\nIf your academic status is Academic Pause, you will not be permitted to undertake any studies for two consecutive study periods.\nYou are not required to take a leave of absence while on Academic Pause and these study periods will not count towards your leave entitlement.\n\nWhat happens after my application has been processed?\nYou will be able to see the status of your application via eStudent. Go to the 'My Overview' tile, then click the 'Coursework Summary' subheading on the left-hand side of the page.\nThe outcome of your application will be sent to your student email within 5 business days of submitting your Leave of Absence request, so make sure you keep an eye on your student email for this information.\n\nWhy can't I apply for Leave of Absence?\nIf you are a Next Step or Non-Award student, or studying via Open Universities Australia (OUA) this service is not available to you. Students on Academic Pause are also unable to take a Leave of Absence.\n\nCan HDR students take a leave of absence?\nIf you are a Higher Degree Research student and you wish to take a leave of absence, please contact theGraduate Research Academy (GRA).\n\nWhat do I do while I'm on leave and before I resume my study?\nWhile you are on leave of absence, you must keep your contact details up to date and continue to check your student email account.\nIf you want to extend your return date, you can submit a new Leave of Absence application via eStudent to cover the additional period of leave you wish to take. All university facilities and services are still available to you while you are on leave, for example, the Library, Student Wellbeing, Careers.\nBefore you return to your study, please check your student email account for any re-enrolment information.\n\nWhat happens if I do not return to studies after 12 months' leave of absence?\nIf you do not enrol in the subsequent study period and record a grade once you have exceeded 12 months of leave, you will be discontinued from your course.\nTo return to your course after being discontinued, you will need to reapply to the University to continue in your course. This will reset your leave entitlements.\n\nWhat do I need to do if I want to return from my leave of absence early?\nPlease submit an enquiry through the Service Connect portal requesting a change to your current leave of absence.\n\nRelated articles\nAcademic Standing\n\n\n"
  }
]